para exer
clea
if empty(exer)
   ?'Запустите START.BAT'
   inkey(3)
   retu
endif
if upper(exer)#'S'
   ?'Запустите START.BAT'
   inkey(3)
   retu
endif


gnArm=2

priv menu[7]
MENU[3] := "Справочники"
MENU[4] := "Подготовка"
MENU[5] := "Печать"
MENU[6] := "Остатки"
MENU[7] := "Сервис"

lmenur=len(menu)  // Количество pad
priv CL_L[lmenur]  // Позиция pad
priv sizam[lmenur] // Количество bar


priv menu3[22]
MENU3[1]   := "Счета        "
MENU3[2]   := "Обор.клиентов"
MENU3[3]   := "Бух.проводки "
MENU3[4]   := "Типы докум.  "
*MENU3[5]   := "Склады       "
MENU3[5]   := "Скл.проводки "
MENU3[6]   := "Скл.коды затр"
MENU3[7]   := "Подразделения"
MENU3[8]   := "Напр.затрат  "
MENU3[9]  := "Издержки     "
MENU3[10]  := "Возвр.тара   "
MENU3[11]  := "Клиенты      "
MENU3[12]  := "Лицензии     "
MENU3[13]  := "Группы товара"
MENU3[14]  := "Типы лицензий"
MENU3[15]  := "Опер.расход  "
MENU3[16]  := "Опер.приход  "
MENU3[17]  := "Типы цен     "
MENU3[18]  := "Банки        "
MENU3[19]  := "Отделы"
MENU3[20]  := "Счета в банк."
MENU3[21]  := "Формы оплаты "
MENU3[22]  := "Тип документа"

priv menu4[10]
MENU4[1] := "Касса 301XXX     "
MENU4[2] := "Касса сервис     "
MENU4[3] := "Банк  311XXX     "
MENU4[4] := "Все счета        "
MENU4[5] := "Передача         "
MENU4[6] := "Прием            "
MENU4[7] := "Закр/Откр периода"
MENU4[8] := "Контрольная сумма"
MENU4[9] := "Протокол         "
MENU4[10] := "Оплата           "

priv menu5[8]
MENU5[1] := "Журнал-ордер         "
MENU5[2] := "Дебеторы - Кредиторы "
MENU5[3] := "Оборотный баланс     "
MENU5[4] := "Реестр бал. счета    "
MENU5[5] := "Обор.ведом.по клиент."
MENU5[6] := "Рег. кассовых ордеров"
MENU5[7] := "Главная книга        "
MENU5[8] := "Взаимозачет(204001)  "

priv menu6[9]
MENU6[1] := "Просмотр остатков  "
MENU6[2] := "Финансы клиентов   "
MENU6[3] := "Банковская выписка "
MENU6[4] := "Клиент за год      "
MENU6[5] := "Просмотр проводок  "
MENU6[6] := "Модифиц. документы "
MENU6[7] := "НН выданные        "
MENU6[8] := "НН полученные      "
MENU6[9] := "Формы 1-OA,1-PA"

priv menu7[16]
MENU7[1] := " 1.Индексация "
MENU7[2] := " 2.Переворот  "
MENU7[3] := " 3.Удал.сторно"
MENU7[4] := " 4.DOKK       "
MENU7[5] := " 5.BSт        "
MENU7[6] := " 6.BSт DKKLNнт"
MENU7[7] := " 7.DOKS,DOKZ  "
MENU7[8] := " 8.DOKKO      "
MENU7[9] := " 9.Тест Гл.кн."
MENU7[10] := "10.DKKLN н пер"
MENU7[11] := "11.КассаОплата"
MENU7[12] := "12.DKKLN пер  "
MENU7[13] := "13.MODDOC корр"
MENU7[14] := "14.DOKK(O)361 "
MENU7[15] := "15.DKNAP пер  "
MENU7[16] := "16.DKKLN 361  "


SIZAM[3] := len(menu3)
SIZAM[4] := len(menu4)
SIZAM[5] := len(menu5)
SIZAM[6] := len(menu6)
SIZAM[7] := len(menu7)

maine()
