///////////////////////
Function HEAD1
Setprc(0,0)
i=1
Stri = 1
opfhr=getfield('t1','kplr','kln','opfh')
S43=''
S0  = ' '
*S00  = upper(gcNent)+space(130)+'Лист '+str(nlstrr,2)
S00  = space(140)+'Лист '+str(nlstrr,2)
S1  = 'П О Д А Т К О В А   Н А К Л А Д Н А'
S2  = 'Дата виписки податковоi накладноi: ' + Dtoc(Dtt) + '                                      Порядковий номер __' + Str(nomndsr,10)+iif(gnEnt=14,'/01',iif(gnEnt=15,'/02',iif(gnEnt=17,'/03','')))
S3  ='' && 'Продавець: ' + gcName_c + '                            Покупець: ' + Nklr
S4  = 'Особа (платник податку) - продавець: '+subs(gcName_c,1,30)+space(16)+'Особа (платник податку) - покупець: '+subs(Nklr,1,40)
s44 =padr(subs(gcName_c,31),60,' ')+space(23)+padr(subs(Nklr,41),60,' ')
S5  = lzero(gnKnal_c,12) + '                                                               ' +iif(opfhr=910,lzero(Nnr,10),iif(kplr=5785448,str(nnr,12),lzero(Nnr,12)))
*S5  = lzero(gnKnal_c,12) + '                                                               ' +iif(opfhr=910,lzero(Nnr,10),iif(kplr=5785448,str(nnr,12),lzero(Nnr,12)))+iif(len(nklr)<45,'',space(13)+subs(nklr,45))
*S5  = str(gnKnal_c,12) + '                                                               ' + lzero(Nnr,12)+iif(len(nklr)<45,'',space(13)+subs(nklr,45))
*S5  = str(gnKnal_c,12) + '                                                               ' + str(Nnr,12)+iif(len(nklr)<45,'',space(13)+subs(nklr,45))
S6  = 'Мiсце знаходження продавця                                                         Мiсце знаходження покупця' 
S7  =  subs(gcAdr_c,1,67) + space(20) + subs(Adrr,1,67)
S77  = subs(gcAdr_c,68,43) + space(44) + subs(Adrr,68)
S8  = 'Номер телефону: ' + gcTlf_c + '                                                         Номер телефону: ' + Tlfr
S9  = 'Номер свiдоцтва про реестрацiю платника                                            Номер свiдоцтва про реестрацiю платника'
S10 = 'податку на додану вартiсть(продавця)' +  '                                               податку на додану вартiсть(покупця) ' 
S11 = '             ' + gcSvid_c + '                                                     ' + Nsvr
cntttnr=len(attt)
if cntttnr=1.and.prnnr=1
   s111='ТTH N '
   for i=1 to knds
       ttnr=arab[i,1]
       s111=s111+ Str(Ttnr,6)+' '+ 'за '+dtoc(dotr)
*       s111=s111+ Str(Ttnr,6)+' '+ 'за '+dtoc(dopr)
   next
else
   if prnnr=1
      s111='TTH за '+umg(gdTd)
   else
      s111='Документом N '
      for i=1 to knds
          ttnr=arab[i,1]
          s111=s111+str(ttnr,6)+','+' за '+dtoc(ddokr)
      next
   endif
endif
if dtt>ctod('28/07/2005')
   sele klndog
   if fieldpos('cndog')=0
      ss111=' договором '+str(getfield('t1','kplr','klndog','ndog'),6)+' вiд '+dtoc(getfield('t1','kplr','klndog','dtdogb'))
   else
      if empty(getfield('t1','kplr','klndog','cndog'))
         ss111=' договором поставки '+str(getfield('t1','kplr','klndog','ndog'),6)+' вiд '+dtoc(getfield('t1','kplr','klndog','dtdogb'))
      else
         ss111=' договором поставки '+alltrim(getfield('t1','kplr','klndog','cndog'))+' вiд '+dtoc(getfield('t1','kplr','klndog','dtdogb'))
      endif
   endif   
   S12 = 'Умова поставки _____ згiдно з '+ss111+' '+s111+' '+Str(kplr,7)
else
   S12 = 'Умова продажу _____ згiдно з '+s111+' '+Str(kplr,7)
endif   

S13 = 'Форма проведених разрахункiв: ' + iif(fopr=0,'р/р',getfield('t1','fopr','fop','nfop'))

@ Prow()+1,1 Say S00
Stri ++
@ Prow()+1,1 Say '┌─────────────────────────────┬─────┐'+space(85)+'ЗАТВЕРДЖЕНО'
Stri ++
@ prow()+1,1 say '│Оригiнал(видається покупцю  )│     │'+space(70)+'наказом ДПА Украiни вiд 30.05.97 р. N 165'
Stri ++
@ prow()+1,1 say '│Копiя(залишається у продавця)│     │'+space(64)+'(у редакцii наказу ДПА Украiни вiд 08.10.98 р. N 469,'
Stri ++
@ Prow()+1,1 Say '└─────────────────────────────┴─────┘'+space(55)+'з урахуванням змiн,внесених наказом ДПА Украiни вiд 30.06.05р N244)'
Stri ++
@ Prow()+1,1 Say 'Непотрiбне вiдмiтити помiткою X'
Stri ++
*if dtt>ctod('28/07/2005')
*   @ Prow()+1,1 Say 'Непотрiбне вiдмiтити помiткою X'
*else
*   @ Prow()+1,1 Say 'Непотрiбне вiдмiтити помiткою X' &&+space(70)+'(у редакцii наказу ДПА Украiни вiд 08.10.98 р. N 469)'
*endif   
*if dtt>ctod('28/07/2005')
*   @ Prow()+1,40 Say S1+space(12)+'з урахуванням змiн,внесених наказом ДПА Украiни вiд 30.06.05р N244)'
*   Stri ++
*else
@ Prow()+1,56 Say S1
Stri ++
*endif   
@ Prow()+1,1  Say S2
Stri ++
*@ Prow()+1,1  Say S3
*Stri ++
@ Prow()+1,1  Say S4
Stri ++
@ Prow()+1,1  Say S44
Stri ++
@ Prow()+1,10 Say S5
Stri ++
@ Prow()+1,1  Say S6
Stri ++
@ Prow()+1,5  Say S7
Stri ++
if !empty(s77)
   @ Prow()+1,1  Say S77
   Stri ++
endif
@ Prow()+1,1  Say S8
Stri ++
@ Prow()+1,1  Say S9
Stri ++
@ Prow()+1,1  Say S10
Stri ++
@ Prow()+1,1  Say S11
Stri ++
@ Prow()+1,1  Say S12
Stri ++
@ Prow()+1,1  Say S13
Stri ++

//////////////////////
Function HEAD2
Setprc(0,0)
if dtt>ctod('28/07/2005')
   S14 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S15 =' Р |   Дата   |          Номенклатура поставки товарiв           |Один.| Кiлькiсть|   Цiна   |      Обсяг поставки(база оподаткування)     |  Загальна  '
   S16 =' О |вiдвантаж.|          (послуг) продавця                       | вим.|(об"ем,   |поставки  |      без урахування ПДВ,що пiдлягають       |  сума кошт '
   S17 =' З |(виконання|                                                  |това-| обсяг)   |одиницi   |          оподаткуванню за ставками          |  що пiдляг '
   S18 =' Д |поставки  |                                                  |ру   |          |продукцii |---------------------------------------------|  оплатi    '
   S19 =' I |(оплати*) |                                                  |     |          |без урах. |     20%    |0% реалiз |    0%    |звiльнення|            '
   S20 =' Л |товарiв   |                                                  |     |          |  ПДВ     |            |на митн.  | експорт  |вiд ПДВ   |            '
   S201=' Л |(послуг)  |                                                  |     |          |          |            |тер Укр   |          |          |            '
   S21 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S22 =' 1 |    2     |                          3                       |  4  |     5    |     6    |      7     |     8    |     9    |    10    |     11     '
   S23 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S24 ='I  |          |                                                  |     |          |          |            |          |          |          |            '
else
   S14 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S15 =' Р |   Дата   |          Номенклатура поставки прдукцii          |Один.| Кiлькiсть|Цiна прод |      Обсяг продажу(база оподаткування)      |  Загальна  '
   S16 =' О |          |                                                  | вим.|          |без ПДВ   |      без урахування ПДВ,що пiдлягають       |  сума кошт '
   S17 =' З |          |                                                  |това-|          |          |          оподаткуванню за ставками          |  що пiдляг '
   S18 =' Д |          |                                                  |ру   |          |          |---------------------------------------------|  оплатi    '
   S19 =' I |          |                                                  |     |          |          |     20%    |0% реалiз |    0%    |звiльнення|            '
   S20 =' Л |          |                                                  |     |          |          |            |на тер Укр| експорт  |вiд ПДВ с5|            '
   S21 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S22 =' 1 |    2     |                          3                       |  4  |     5    |     6    |      7     |     8    |     9    |    10    |     11     '
   S23 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
   S24 ='I  |          |                                                  |     |          |          |            |          |          |          |            '
endif   

@ Prow()+1,1  Say S14
Stri ++
@ Prow()+1,1  Say S15
Stri ++
@ Prow()+1,1  Say S16
Stri ++
@ Prow()+1,1  Say S17
Stri ++
@ Prow()+1,1  Say S18
Stri ++
@ Prow()+1,1  Say S19
Stri ++
@ Prow()+1,1  Say S20
Stri ++
if dtt>ctod('28/07/2005')
   @ Prow()+1,1  Say S201
   Stri ++
endif
@ Prow()+1,1  Say S21
Stri ++
@ Prow()+1,1  Say S22
Stri ++
@ Prow()+1,1  Say S23
Stri ++
@ Prow()+1,1  Say S24
Stri ++
***************************************************************************
Function HEAD3
Setprc(0,0)
Stri = 1
@ prow()+1,1 say 'Орiгинал(видається покупцю  )'
Stri ++
@ prow()+1,1 say 'Копiя(залишається у продавця)'
Stri ++
@ prow()+1,1 say ' '
stri++
@ prow()+1,30 say 'Р О З Р А Х У Н О К     N '+str(nomndsr,10)+iif(gnEnt=14,'/01',iif(gnEnt=15,'/02',iif(gnEnt=15,'/03','')))
stri++
@ prow()+1,20 say 'коригування кiлькiстних i вартiсних показникiв до податковоi накладноi'
stri++
if pcor=2
   if !empty(nomndsvzr)
      @ prow()+1,20 say 'вiд '+dtoc(dnnvzr)+' N '+str(nomndsvzr,10)+' по договору вiд      N      '
   else 
      @ prow()+1,20 say 'вiд '+dtoc(dnzr)+' N '+nnzr+' по договору вiд      N      '
   endif
   dtt=dnzr
else
   @ prow()+1,20 say 'вiд '+gr1r+' N '+str(ndsdr,6)+' по договору вiд      N      '
   dtt=ctod(gr1r)
endif
stri++
@ prow()+1,1 say ''
stri++
@ prow()+1,1 say  'Продавець: ' + gcName_c + '                               Покупець: ' + Nklr
stri++
@ prow()+1,1 say 'Особа (платник податку) - продавець:                                    Особа (платник податку) - покупець:'
stri++
@ prow()+1,1 say  Str(gnKnal_c,12) + '                                                               ' + Str(Nnr,12)
stri++
@ prow()+1,1 say 'Мiсце знаходження продавця                                              Мiсце знаходження покупця' 
stri++
@ prow()+1,1 say gcAdr_c + '                                           ' + Adrr
stri++
@ prow()+1,1 say 'Номер телефону: ' + gcTlf_c + '                                              Номер телефону: ' + Tlfr
stri++
@ prow()+1,1 say 'Номер свiдоцтва про реестрацiю платника                                 Номер свiдоцтва про реестрацiю платника'
stri++
if dtt>ctod('28/07/2005')
   @ prow()+1,1 say '        на додану вартiсть                                                       на додану вартiсть'
stri++
endif
@ prow()+1,1 say 'податку ' + gcSvid_c + '                                            податку ' + Nsvr
stri++
if pcor=2
   if dtt>ctod('28/07/2005')
      @ prow()+1,1 say 'Умова поставки _____ договор  купли  продажи                             Код клиента '+str(kklr,7)
   else
      @ prow()+1,1 say 'Умова продажу _____ договор  купли  продажи                             Код клиента '+str(kklr,7)
   endif   
else
   if dtt>ctod('28/07/2005')
      @ prow()+1,1 say 'Умова поставки _____ згiдно з '+iif(len(attn)<=1.and.prnnr=1,'TTH N'+ Str(Ttnr,6)+' за '+dtoc(dotr),iif(prnnr=1.and.len(attn)>=2,'TTH за '+umg(gdTd),'Документом N '+str(ttnr,6)+' за '+dtoc(ddokr)))+' '+Str(kplr,7)
   else
      @ prow()+1,1 say 'Умова продажу _____ згiдно з '+iif(len(attn)<=1.and.prnnr=1,'TTH N'+ Str(Ttnr,6)+' за '+dtoc(dotr),iif(prnnr=1.and.len(attn)>=2,'TTH за '+umg(gdTd),'Документом N '+str(ttnr,6)+' за '+dtoc(ddokr)))+' '+Str(kplr,7)
   endif   
endif
*@ prow()+1,1 say 'Умова продажу _____ згiдно з '+'TTH N'+ Str(Ttnr,6)+' за '+dtoc(dotr)+' '+str(kplr,7)
stri++
@ prow()+1,1 say 'Дата оплати'
stri++
if pcor=2
   @ prow()+1,1 say 'Форма проведення разрахункiв: р/р' 
else
   @ prow()+1,1 say 'Форма проведення разрахункiв: ' + iif(empty(Nopr),'р/р',nopr)
endif

//////////////////////
Function HEAD4
Setprc(0,0)

if dtt>ctod('28/07/2005')
   @ prow()+1,1 say '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'
   stri++
   @ prow()+1,1 say '|   Дата   |    Причина       |   Номенклатура товарiв (послуг), вартiсть чи     |Один.|Коригування кiлькостi| Коригування вартостi| Пiдлягають коригуванню обсяги  |Проведення коригування под.забов.та кредиту|'
   stri++
   @ prow()+1,1 say '|коригуван |   коригування    |          кiлькiсть яких коригуеться              | вим.|---------------------|---------------------|     без урахування ПДВ,що      |-------------------------------------------|'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     |   Змiна  |   Цiна   |  Змiна   | Кiлькшсть|  оподатковуються за ставками   |При вiд-му знач.гр 9 |При позит.знач.гр 9  |'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     | кiлькоcтi| поставки |   цiни   | поставки |----------------------------------------------------------------------------|'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     |об"ем,обся|тов(посл) | (-) (+)  |тов(посл) |    20%   |     0%   |звiльнення|Забов-ння |  Кредит  |Забов-ння |  Кредит  |'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     |  (-) (+) |          |          |          |  (-) (+) |  (-) (+) |вiд ПДВ с5|гр.9(-)20%|гр.9(-)20%|гр.9(+)20%|гр.9(+)20%|'
   stri++
else
   @ prow()+1,1 say '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'
   stri++
   @ prow()+1,1 say '|   Дата   |    Причина       |          Номенклатура поставки прдукцii          |Один.|Коригування кiлькостi| Коригування вартостi| Пiдлягають коригуванню обсяги  |Проведення коригування под.забов.та кредиту|'
   stri++
   @ prow()+1,1 say '|          |   коригування    |                                                  | вим.|---------------------|---------------------|     без урахування ПДВ,що      |-------------------------------------------|'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |това-|   Змiна  |   Цiна   |  Змiна   | Кiлькшсть|  оподатковуються за ставками   |При вiд-му знач.гр 9 |При позит.знач.гр 9  |'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |ру   | кiлькоcтi| поставки |   цiни   | поставки |----------------------------------------------------------------------------|'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     |  (-) (+) |  (-) (+) |  (-) (+) |          |    20%   |     0%   |звiльнення|Забов-ння |  Кредит  |Забов-ння |  Кредит  |'
   stri++
   @ prow()+1,1 say '|          |                  |                                                  |     |          |          |          |          |  (-) (+) |  (-) (+) |вiд ПДВ с5|гр.9(-)20%|гр.9(-)20%|гр.9(+)20%|гр.9(+)20%|'
   stri++
endif   
@ prow()+1,1 say    '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'
stri++
@ prow()+1,1 say    '|    1     |        2         |                          3                       |  4  |     5    |     6    |     7    |     8    |     9    |    10    |    11    |    12    |    13    |    14    |    15    |'
stri++
@ prow()+1,1 say    '----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|'
stri++
@ prow()+1,1 say    '|          |                  |                                                  |     |          |          |          |          |          |          |          |          |          |          |          |'
stri++
@ prow()+1,1 say ''
**********************************************************************
proc foot1
      *       ' 1 |    2     |                          3                       |  4  |     5    |     6    |     7    |     8    |     9    |    10    |    11    '
if rndsr=2
       S26 ='II | Товаро-транспортнi витрати                                  |     |          |          |          |          |          |'+Str(Trn,10,2)+'|'+Str(Trn,10,2)
       If Tararr = 1
             S27 ='III| Зворотня(заставна) тара                                     |     |          |          |          |          |          |          |'+Str(Sum_t,10,2)
       Else
             S27 ='III| Зворотня(заставна) тара                                     |     |          |          |          |          |          |          |'+Str(0,10,2)
       EndIf
       S28 ='IV | Надано покупцю: | надбавка (+)                              |     |          |          |          |          |          |'+Str(Sum_n,10,2)+'|'+Str(Sum_n,10,2)
       S29 ='   |                 | знижка   (-)                              |     |          |          |          |          |          |'+Str(Sum_s,10,2)+'|'+Str(Sum_s,10,2)
else
       S26 ='II | Товаро-транспортнi витрати                                  |     |          |          |'+Str(Trn,12,2)+'|          |          |          |'+Str(Trn,10,2)
       If Tararr = 1

             S27 ='III| Зворотня(заставна) тара                                     |     |          |          |            |          |          |          |'+Str(Sum_t,10,2)
       Else
          S27 ='III| Зворотня(заставна) тара                                     |     |          |          |            |          |          |          |'+Str(0,10,2)
       EndIf
       S28 ='IV | Надано покупцю: | надбавка (+)                              |     |          |          |'+Str(Sum_n,12,2)+'|          |          |          |'+Str(Sum_n,10,2)
       S29 ='   |                 | знижка   (-)                              |     |          |          |'+Str(Sum_s,12,2)+'|          |          |          |'+Str(Sum_s,10,2)
endif



*            ' 1 |    2     |                          3                       |  4  |     5    |     6    |     7    |     8    |     9    |    10    |    11    '
Do Case
   Case rndsr = 5.or.rndsr=0
           S30 ='V  | Усього по роздiлах I + II + IV                              |     |          |          |'+Str(sgr7+Trn+Sum_n-Sum_s,12,2)+'|          |          |          |'+Str(sgr7+Trn+Sum_n-Sum_s,10,2)
   Case rndsr = 1
        S30 ='V  | Усього по роздiлах I + II + IV                              |     |          |          |'+Str(sfr,12,2)+'|          |          |          |'+Str(sfr,10,2)
   Case rndsr = 2
        S30 ='V  | Усього по роздiлах I + II + IV                              |     |          |          |            |          |          |'+Str(sfr,10,2)+'|'+Str(sfr,10,2)
   Case rndsr = 3
        S30 ='V  | Усього по роздiлах I + II + IV                              |     |          |          |'+Str(sfr,12,2)+'|          |          |          |'+Str(sfr,10,2)
   Case rndsr = 4
        S30 ='V  | Усього по роздiлах I + II + IV                              |     |          |          |'+Str(sgr7+Trn+Sum_n-Sum_s,12,2)+'|          |          |          |'+Str(sgr7+Trn+Sum_n-Sum_s,10,2)
EndCase

if rndsr=2
        S31 ='VI | Податок на додану вартiсть                                  |     |          |          |            |          |          |'+str(Sum_nds,10,2)+'|'+Str(Sum_nds,10,2)
        S32 ='VII| Загальна сума з ПДВ                                         |     |          |          |            |          |          |'+str(Sum_all-sum_t,10,2)+'|'+Str(Sum_all,10,2)
else
        S31 ='VI | Податок на додану вартiсть                                  |     |          |          |'+Str(Sum_nds,12,2)+'|          |          |          |'+Str(Sum_nds,10,2)
           S32 ='VII| Загальна сума з ПДВ                                         |     |          |          |'+Str(Sum_all-sum_t,12,2)+'|          |          |          |'+Str(Sum_all,10,2)
endif
S33 ='------------------------------------------------------------------------------------------------------------------------------------------------------------------------'
if dtt>ctod('28/07/2005')
   S34 ='Суми ПДВ, нарахованi(сплаченi) в зв"язку з поставкою товарiв(послуг),зазначених в цiй накладнiй визначенi правильно,'
   S35 ='вiдповiдають сумi податкових зобов"язань продавця i включенi до реестру отриманих та виданих податкових накладних.' 
else
   S34 ='Суми ПДВ, нарахованi(сплаченi) в зв"язку з продажем товарiв(робiт,послуг),зазначених в цiй накладнiй визначенi правильно,'
   S35 ='вiдповiдають сумi податкових зобов"язань продавця i включенi до книги облiку продажу.' 
endif   
S36 =''
S37 =''
S38 ='                                                                               ___________________________________________/'+gcName
S39 ='                                                                               Пiдпис особи, яка склала податкову накладну           П.I.Б.'
S40 ='-----------------------------------------------------------------------------------------------------------------------------------------------------------------------'
if dtt>ctod('28/07/2005')
   S41 ='* Дата оплати ставиться у разi попередньоi оплати поставки, на яку виписуеться податкова накладна; для бартерних операцiй - дата оприбуткування товарiв,'
   S42 ='попередньо одержаних в оплату поставки; дата попереднього одержання послуг в оплату поставки; для операцiй з поставки товарiв(послуг) за касовим'
   S43 ='методом вiдповiдно до Закону Украiни "Про податок на додану вартicть"'
else
   S41=''
   S42=''
   S43=''
endif   

@ Prow()+1,1 Say S26
@ Prow()+1,1 Say S27
@ Prow()+1,1 Say S28
@ Prow()+1,1 Say S29
@ Prow()+1,1 Say S30
@ Prow()+1,1 Say S31
@ Prow()+1,1 Say S32
@ Prow()+1,1 Say S33
@ Prow()+1,1 Say S34
@ Prow()+1,1 Say S35
@ Prow()+1,1 Say S36
@ Prow()+2,1 Say S37
@ Prow()+2,1 Say S38
@ Prow()+1,1 Say S39
@ Prow()+1,1 Say S40
@ Prow()+1,1 Say S41
@ Prow()+1,1 Say S42
@ Prow()+1,1 Say S43
Setprc(0,0)
EJECT
**********************************************************************
proc foot2
       sgr1r =space(10)   && Дата
       sgr2r =space(18)  && Причина
       if pcor=2
          sgr3r ='Итого:'+space(44)  && Наименование
       else
          sgr3r =space(50)  && Наименование
       endif
       sgr4r =space(5)   && Ед изм.
       sgr5r =space(10)  && Изм.кол-ва (корр.кол-ва)
       sgr6r =space(10)  && Изм.цены   (корр.кол-ва)
       sgr7r =space(10)  && Изм.цены   (корр.стоимости)
       sgr8r =space(10)  && Изм.кол-ва (корр.стоимости)
       sgr9r =str(sgr9,10,2)  && 20%
       sgr10r=space(10)  &&  0%
       sgr11r=space(10)  && ст.5
       sgr12r=str(sgr12,10,2)  && ум.обяз.(отр.гр.9)
       if pcor=2
          sgr13r=str(sgr13,10,2)  && ум.кред.(отр.гр.9)
          sgr14r=space(10)  && ув.обяз.(пол.гр.9)
          sgr15r=space(10)  && ув.кред.(пол.гр.9)
       else  
          sgr13r=str(sgr13,10,2)  && ум.кред.(отр.гр.9)
          sgr14r=str(sgr14,10,2)  && ув.обяз.(пол.гр.9)
          sgr15r=str(sgr15,10,2)  && ув.кред.(пол.гр.9)
       endif

listr='|'+sgr1r+'|'+sgr2r+'|'+sgr3r+'|'+sgr4r+'|'+sgr5r+'|'+sgr6r+'|'+sgr7r;
       +'|'+sgr8r+'|'+sgr9r+'|'+sgr10r+'|'+sgr11r+'|'+sgr12r+'|'+sgr13r+'|'+sgr14r;
       +'|'+sgr15r+'|'
@ Prow()+1,1 Say listr               

@ prow()+1,1 say '-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'
if dtt>ctod('28/07/2005')
   @ prow()+1,1 say 'Суми ПДВ,якi скоригованi у зв"язку зi змiною кiлькiсних чи вартiсних показникiв,що зазначенi в цьому розрахунку,визначенi'
   @ prow()+1,1 say 'правильно,включенi вiдповiдно до податкового забов"язання з одночасним вiдображенням у реестрi отриманих та виданих      '       
   @ prow()+1,1 say 'податкових накладних.'
else
   @ prow()+1,1 say 'Суми ПДВ,якi скоригованi у зв"язку зi змiною кiлькiсних чи вартiсних показникiв,що зазначенi в цьому розрахунку,визначенi'
   @ prow()+1,1 say 'правильно,включенi вiдповiдно до податкового забов"язання з одночасним вiдображенням у книзi облiку продажу.'       
   @ prow()+1,1 say ''
endif   
@ prow()+1,1 say '                                                            _____________________________________________________________'
@ prow()+1,1 say '                                                          (дата,пiдпис i прiзвище особи,яка склала розрахунок коригування)'
@ prow()+1,1 say 'Розрахунок коригування вiд_________________________N______до податковоi накладноi вiд____________________N_________отримав'
if dtt>ctod('28/07/2005')
   @ prow()+1,1 say ''
else
   @ prow()+1,1 say 'i зобов"язуюся включити суми коригування до книги облiку придбання та сум податкового кредиту i податкового забов"язання.'
endif   
@ prow()+1,1 say ''
@ prow()+1,1 say '                                                            _____________________________________________________________'
@ prow()+1,1 say '                                                                     (дата отримання розрахунку,пiдпис покупця)'
@ prow()+1,1 say '  '

retu
**************************************
func head5
S00  = space(140)+'Лист '+str(nlstrr,2)
Setprc(0,0)
S13 ='----------------------------------------------------------------------------------------------------------------------------------------------------'
S14 =' Р |   Дата   |Номенклатура поставки прдукцii                    |Один.| Кiлькiсть|Цiна прод |     Обсяг продажу(база оподаткування)     |Загальна  '
S15 =' О |          |                                                  | вим.|          |без ПДВ   |     без урахування ПДВ,що пiдлягають      |сума кошт '
S16 =' З |          |                                                  |това-|          |          |         оподаткуванню за ставками         |що пiдляг '
S17 =' Д |          |                                                  |ру   |          |          |-------------------------------------------|оплатi    '
S18 =' I |          |                                                  |     |          |          |    20%   |0% реалiз |    0%    |звiльнення|          '
S19 =' Л |          |                                                  |     |          |          |          |на тер Укр| експорт  |вiд ПДВ с5|          '
S20 ='----------------------------------------------------------------------------------------------------------------------------------------------------'
S21 =' 1 |    2     |                3                                 |  4  |     5    |     6    |     7    |     8    |     9    |    10    |    11    '
S22 ='----------------------------------------------------------------------------------------------------------------------------------------------------'
@ Prow()+1,1 Say S00
Stri ++
@ Prow()+1,1 Say S13
Stri ++
@ Prow()+1,1  Say S14
Stri ++
@ Prow()+1,1  Say S15
Stri ++
@ Prow()+1,1  Say S16
Stri ++
@ Prow()+1,1 Say S17
Stri ++
@ Prow()+1,1  Say S18
Stri ++
@ Prow()+1,1  Say S19
Stri ++
@ Prow()+1,1  Say S20
Stri ++
@ Prow()+1,1  Say S21
Stri ++
@ Prow()+1,1  Say S22
Stri ++
retu
********************
func head11()
********************
Setprc(0,0)
i=1
Stri = 1
opfhr=getfield('t1','kplr','kln','opfh')
S43=''
S0  = ' '
S00  =str(ttnr,6)+space(134)+'Лист '+str(nlstrr,2)
S1  = 'П О Д А Т К О В А   Н А К Л А Д Н А'
S2  = 'Дата виписки податкової накладної: ' + Dtoc(Dtt) + '                                      Порядковий номер __' + Str(nomndsr,10)+iif(gnEnt=14,'/01',iif(gnEnt=15,'/02',iif(gnEnt=17,'/03','')))
s21 = '                                       ┌─┬─┬─┬─┬─┬─┬─┬─┐                                             ┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐ ┌─┬─┬─┬─┐'
S22 = 'Дата виписки податкової накладної:     ' + rzdt(dtt) + '                           Порядковий номер  '+rznum(nomndsr,10)+'/'+rznum(0,4)
s23 = '                                       └─┴─┴─┴─┴─┴─┴─┴─┘                                             └─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘ └─┴─┴─┴─┘'
s24 = '                                                                                                                         (номер фiлiї)'
S3  ='' && 'Продавець: ' + gcName_c + '                            Покупець: ' + Nklr

nn11r=iif(len(gcNamep_c)>50,subs(gcNamep_c,1,50),padr(gcNamep_c,50)) 
if len(gcNamep_c)>50
   nn12r=iif(len(subs(gcNamep_c,51,50))>50,subs(gcNamep_c,51,50),padr(subs(gcNamep_c,51,50),50)) 
else
   nn12r=space(50) 
endif    
nn21r=iif(len(nklr)>50,subs(nklr,1,50),padr(nklr,50)) 
if len(nklr)>50
   nn22r=iif(len(subs(nklr,51,50))>50,subs(nklr,51,50),padr(subs(nklr,51,50),50)) 
else
   nn22r=space(50) 
endif    
s40=space(21)+'┌──────────────────────────────────────────────────┐'+space(30)+'┌──────────────────────────────────────────────────┐'
s41='Особа (платник       │'+nn11r+'│'+space(10)+'Особа (платник      │'+nn21r+'│'
s42='податку) - продавець │'+nn12r+'│'+space(10)+'податку) - покупець │'+nn22r+'│'
s43=space(21)+'└──────────────────────────────────────────────────┘'+space(30)+'└──────────────────────────────────────────────────┘'
s44=space(21)+'  (найменування; прiзвище, iм"я, по батьковi - для '+space(32)+' (найменування;прiзвище,iм"я,по батьковi, - для    '
s45=space(21)+'            фiзичної особи - пiдприємця)           '+space(32)+'            фiзичної особи - пiдприємця)           '

*wait cnnr

s51='┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(58)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
s52=rznum(gnKnal_c,12) +space(58)+iif(empty(cnnr),rznum(nnr,12),rzchr(cnnr,12,0))
s53='└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(58)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'

adr11r=iif(len(gcAdr_c)>30,subs(gcAdr_c,1,30),padr(gcAdr_c,30)) 
if len(gcAdr_c)>30
   adr12r=iif(len(subs(gcAdr_c,31,30))>30,subs(gcAdr_c,31,30),padr(subs(gcAdr_c,31,30),30)) 
else
   adr12r=space(30) 
endif    
adr21r=iif(len(adrr)>40,subs(adrr,1,40),padr(adrr,40)) 
if len(adrr)>40
   adr22r=iif(len(subs(adrr,41,40))>40,subs(adrr,41,40),padr(subs(adrr,41,40),40)) 
else
   adr22r=space(40) 
endif    
S6  = 'Мiсцезнаходження           '+adr11r+space(26)+'Мiсцезнаходження          '+adr21r 
S7  = '(податкова ареса) продавця '+adr12r+space(26)+'(податкова ареса) покупця '+adr22r

tt1r=strtran(alltrim(gcTlf_c),'-') 
tt2r=strtran(alltrim(Tlfr),'-') 
s81=space(16)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(46)+space(16)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
S82='Номер телефону: ' + rzchr(tt1r,10,0)+space(46)+'Номер телефону: ' + rzchr(tt2r,10,0)
s83=space(16)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(46)+space(16)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'

S9  = 'Номер свiдоцтва про          '+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(33)+'Номер свiдоцтва про         '+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
S10 = 'реєстрацiю платника податку  '+rzchr(alltrim(gcSvid_c),10,0)+space(33)+'реєстрацiю платника податку '+rzchr(alltrim(Nsvr),10,0) 
S11 = 'на додану вартiсть(продавця) '+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(33)+'на додану вартiсть(покупця) '+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'
   
cntttnr=len(attt)
if cntttnr=1.and.prnnr=1
   s111='ТTH N '
   for i=1 to knds
       ttnr=arab[i,1]
       s111=s111+ Str(Ttnr,6)+' '+ 'за '+dtoc(dotr)
   next
else
   if prnnr=1
      s111='TTH за '+umg(gdTd)
   else
      s111='Документом N '
      for i=1 to knds
          ttnr=arab[i,1]
          s111=s111+str(ttnr,6)+','+' за '+dtoc(ddokr)
      next
   endif
endif

sele klndog
if empty(getfield('t1','kplr','klndog','cndog'))
   ss111=' вiд '+dtoc(getfield('t1','kplr','klndog','dtdogb'))+' N '+str(getfield('t1','kplr','klndog','ndog'),6)
else
   ss111=' вiд '+dtoc(getfield('t1','kplr','klndog','dtdogb'))+' N '+alltrim(getfield('t1','kplr','klndog','cndog'))
endif

dd_r=getfield('t1','kplr','klndog','dtdogb')
cndogr=alltrim(getfield('t1','kplr','klndog','cndog'))
if empty(cndogr)
   cndogr=alltrim(str(getfield('t1','kplr','klndog','ndog'),6))
endif
s121=space(53)+'┌─┬─┬─┬─┬─┬─┬─┬─┐'+space(3)+'┌─┬─┬─┬─┬─┬─┐'
S122='Вид цивiльно-правового договору:договiр поставки '+'вiд '+rzdt(dd_r)+' N '+rzchr(cndogr,6,0)  &&+' '+str(kplr,7)
s123=space(53)+'└─┴─┴─┴─┴─┴─┴─┴─┘'+space(3)+'└─┴─┴─┴─┴─┴─┘'

S13  = 'Форма проведених разрахункiв: ' + iif(fopr=0,'р/р',getfield('t1','fopr','fop','nfop'))
S131 = '                              '+repl('─',120) 
S132 = '                                 (бартер, готiвка, оплата з поточного рахунку, чек тощо)' 

*@ Prow()+1,1 Say str(ttnr,6)
*Stri ++
@ Prow()+1,1 Say S00
Stri ++

@ Prow()+1,1 Say ''
Stri ++
@ Prow()+1,1 Say ''
Stri ++
@ Prow()+1,1 Say ''
Stri ++
@ Prow()+1,1 Say ''
Stri ++

@ Prow()+1,1 Say '┌────────┬────────────────────┬─────┐'+space(85)+'ЗАТВЕРДЖЕНО'
Stri ++
@ prow()+1,1 say '│        │Видається покупцю   │  X  │'+space(77)+'Наказ Державної податкової'
Stri ++
@ prow()+1,1 say '│        ├────────────────────┼─────┤'
Stri ++
@ prow()+1,1 say '│Оригiнал│Включено до ЄРПН    │     │'+space(79)+'адмiнiстрацiї України'
Stri ++
@ prow()+1,1 say '│        ├────────────────────┼─────┤'
Stri ++
@ prow()+1,1 say '│        │Залиш. у продавця   │     │'+space(10)+S1+space(38)+'21.12.2010 N969'
Stri ++
@ prow()+1,1 say '│        │                    ├──┬──┤'
Stri ++
@ prow()+1,1 say '│        │(тип причини)       │  │  │'
Stri ++
@ prow()+1,1 say '├────────┴────────────────────┼──┴──┤'
Stri ++
*@ prow()+1,1 say '├────────┴────────────────────┼─────┤'
*Stri ++
@ prow()+1,1 say '│Копiя(залишається у продавця)│     │'
Stri ++
@ Prow()+1,1 Say '└─────────────────────────────┴─────┘'
Stri ++
@ Prow()+1,1 Say 'Потрiбне вiдмiтити помiткою X'
Stri ++

@ Prow()+1,1  Say S21
Stri ++
@ Prow()+1,1  Say S22
Stri ++
@ Prow()+1,1  Say S23
Stri ++
@ Prow()+1,1  Say S24
Stri ++

@ Prow()+1,1  Say S40
Stri ++
@ Prow()+1,1  Say S41
Stri ++
@ Prow()+1,1  Say S42
Stri ++
@ Prow()+1,1  Say S43
Stri ++
@ Prow()+1,1  Say S44
Stri ++
@ Prow()+1,1  Say S45
Stri ++

@ Prow()+1,1 Say S51
Stri ++
@ Prow()+1,1 Say S52
Stri ++
@ Prow()+1,1 Say S53
Stri ++

@ Prow()+1,1  Say S6
Stri ++

@ Prow()+1,1  Say S7
Stri ++

@ Prow()+1,1  Say S81
Stri ++
@ Prow()+1,1  Say S82
Stri ++
@ Prow()+1,1  Say S83
Stri ++

@ Prow()+1,1  Say S9
Stri ++
@ Prow()+1,1  Say S10
Stri ++
@ Prow()+1,1  Say S11
Stri ++

@ Prow()+1,1  Say S121
Stri ++
@ Prow()+1,1  Say S122
Stri ++
@ Prow()+1,1  Say S123
Stri ++
@ Prow()+1,1  Say S13
Stri ++
@ Prow()+1,1  Say S131
Stri ++
@ Prow()+1,1  Say S132
Stri ++
retu .t.
******************
func head22()
******************
Setprc(0,0)
S14 ='┌──┬──────────┬──────────────────────────────────────────────────┬─────┬──────────┬──────────┬─────────────────────────────────────────────┬────────────┐'
S15 ='│Р │   Дата   │          Номенклатура постачання товарiв/        │Один.│ Кiлькiсть│   Цiна   │    Обсяг постачання(база оподаткування)     │  Загальна  │'
S16 ='│О │вiдвантаж.│                 послуг продавця                  │ вим.│(об"ем,   │постачання│      без урахування ПДВ,що пiдлягають       │сума коштiв │'
S17 ='│З │(виконання│                                                  │това-│ обсяг)   │одиницi   │          оподаткуванню за ставками          │що пiдлягає │'
S18 ='│Д │постачання│                                                  │ру   │          │товару/   ├────────────┬──────────┬──────────┬──────────┤  сплатi    │'
S19 ='│I │(оплати*) │                                                  │     │          │послуг без│     20%    │0%(постач.│    0%    │звiльнення│            │'
S20 ='│Л │товарiв   │                                                  │     │          │урахування│            │на митн.  │(експорт )│вiд ПДВ** │            │'
S201='│  │(послуг)  │                                                  │     │          │   ПДВ    │            │тер Укр)  │          │          │            │'
S21 ='├──┼──────────┼──────────────────────────────────────────────────┼─────┼──────────┼──────────┼────────────┼──────────┼──────────┼──────────┼────────────┤'
S22 ='│1 │    2     │                          3                       │  4  │     5    │     6    │      7     │     8    │     9    │    10    │     11     │'
S23 ='├──┼──────────┼──────────────────────────────────────────────────┼─────┼──────────┼──────────┼────────────┼──────────┼──────────┼──────────┼────────────┤'
S24 ='│I │          │                                                  │     │          │          │            │          │          │          │            │'

@ Prow()+1,1  Say S14
Stri ++
@ Prow()+1,1  Say S15
Stri ++
@ Prow()+1,1  Say S16
Stri ++
@ Prow()+1,1  Say S17
Stri ++
@ Prow()+1,1  Say S18
Stri ++
@ Prow()+1,1  Say S19
Stri ++
@ Prow()+1,1  Say S20
Stri ++
@ Prow()+1,1  Say S201
Stri ++
@ Prow()+1,1  Say S21
Stri ++
@ Prow()+1,1  Say S22
Stri ++
@ Prow()+1,1  Say S23
Stri ++
@ Prow()+1,1  Say S24
Stri ++
retu .t.
**************
func foot11()
**************
S241 ='├──┼─────────────────────────────────────────────────────────────┼─────┼──────────┼──────────┼────────────┼──────────┼──────────┼──────────┼────────────┤'
S27 = '│II│ Зворотня(заставна) тара                                     │  X  │     X    │     X    │     X      │     X    │     X    │     X    │'+Str(Sum_t,12,2)+'│'
S31 = 'III│ Податок на додану вартiсть                                  │  X  │     X    │     X    │'+str(Sum_nds,12,2)+'│          │          │          │'+Str(Sum_nds,12,2)+'│'
S32 = '│IV│ Загальна сума з ПДВ                                         │  X  │     X    │     X    │'+str(Sum_all-sum_t,12,2)+'│          │          │          │'+Str(Sum_all,12,2)+'│'
S33 = '└──┴─────────────────────────────────────────────────────────────┴─────┴──────────┴──────────┴────────────┴──────────┴──────────┴──────────┴────────────┘'

S34 ='Суми ПДВ, нарахованi(сплаченi) в зв"язку з постачанням товарiв/послуг,зазначених у цiй накладнiй, визначенi правильно,'
S35 ='вiдповiдають сумi податкових зобов"язань продавця i включенi до реєстру виданих та отриманих податкових накладних.' 

S36 =''
S37 =''
S38 ='                                                                               ___________________________________________/'+gcName
S39 ='                                                                               Пiдпис i прiзвище особи, яка склала податкову накладну'
S40 ='----------------------------------------------------------------------------------------------------------------------------------------------------------'

S41 ='* Дата оплати ставиться у разi попередньоi оплати постачання, на яку виписуеться податкова накладна, для операцiй з поставки товарiв/послуг вiдповiдно до'
S42 ='пункту 187.10 статтi 187 роздiлу V Податкового кодексу України'
S43 ='**(вiдповiднi пункти(пiдпункти),статтi,пiдроздiли,роздiли Податкового кодексу України,якими передбачено звiльнення вiд оподаткування )'
   

@ Prow()+1,1 Say S241
@ Prow()+1,1 Say S27
@ Prow()+1,1 Say S241
@ Prow()+1,1 Say S31
@ Prow()+1,1 Say S241
@ Prow()+1,1 Say S32
@ Prow()+1,1 Say S33
*@ Prow()+1,1 Say S24
@ Prow()+1,1 Say S34
@ Prow()+1,1 Say S35
@ Prow()+1,1 Say S36
@ Prow()+2,1 Say S37
@ Prow()+2,1 Say S38
@ Prow()+1,1 Say S39
@ Prow()+1,1 Say S40
@ Prow()+1,1 Say S41
@ Prow()+1,1 Say S42
*@ Prow()+1,1 Say S40
@ Prow()+1,1 Say S43
*@ Prow()+1,1 Say str(ttnr,6)
Setprc(0,0)
EJECT
retu .t.
**************************************
func head55()
**************************************
S00  = space(140)+'Лист '+str(nlstrr,2)
Setprc(0,0)
S14 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
S15 =' Р |   Дата   |          Номенклатура постачання товарiв/        |Один.| Кiлькiсть|   Цiна   |    Обсяг постачання(база оподаткування)     |  Загальна  '
S16 =' О |вiдвантаж.|                 послуг продавця                  | вим.|(об"ем,   |постачання|      без урахування ПДВ,що пiдлягають       |сума коштiв '
S17 =' З |(виконання|                                                  |това-| обсяг)   |одиницi   |          оподаткуванню за ставками          |що пiдлягає '
S18 =' Д |постачання|                                                  |ру   |          |товару/   |---------------------------------------------|  сплатi    '
S19 =' I |(оплати*) |                                                  |     |          |послуг без|     20%    |0%(постач.|    0%    |звiльнення|            '
S20 =' Л |товарiв   |                                                  |     |          |урахування|            |на митн.  |(експорт )|вiд ПДВ** |            '
S201='   |(послуг)  |                                                  |     |          |   ПДВ    |            |тер Укр)  |          |          |            '
S21 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
S22 =' 1 |    2     |                          3                       |  4  |     5    |     6    |      7     |     8    |     9    |    10    |     11     '
S23 ='--------------------------------------------------------------------------------------------------------------------------------------------------------'
S24 ='I  |          |                                                  |     |          |          |            |          |          |          |            '

@ Prow()+1,1  Say S14
Stri ++
@ Prow()+1,1  Say S15
Stri ++
@ Prow()+1,1  Say S16
Stri ++
@ Prow()+1,1  Say S17
Stri ++
@ Prow()+1,1  Say S18
Stri ++
@ Prow()+1,1  Say S19
Stri ++
@ Prow()+1,1  Say S20
Stri ++
@ Prow()+1,1  Say S201
Stri ++
@ Prow()+1,1  Say S21
Stri ++
@ Prow()+1,1  Say S22
Stri ++
@ Prow()+1,1  Say S23
Stri ++
@ Prow()+1,1  Say S24
Stri ++
retu .t.
**************
func head33() 
**************
Setprc(0,0)
Stri = 1
@ Prow()+1,1 Say '┌────────┬────────────────────┬─────┐'+space(85)+'Додаток 2'
Stri ++
@ prow()+1,1 say '│        │Видається покупцю   │  X  │'+space(85)+'До податкової нкладної'
Stri ++
@ prow()+1,1 say '│Оригiнал│Включено до ЄРПН    │     │'
Stri ++
@ prow()+1,1 say '│        │Залиш. у продавця   │     │'
Stri ++
@ prow()+1,1 say '│        │(тип причини)       │  │  │'
Stri ++
@ prow()+1,1 say '│Копiя(залишається у продавця)│     │'
Stri ++
@ Prow()+1,1 Say '└─────────────────────────────┴─────┘'
Stri ++
@ Prow()+1,1 Say 'Потрiбне вiдмiтити помiткою X'
Stri ++
*s21 = '                                       ┌─┬─┬─┬─┬─┬─┬─┬─┐                                             ┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐ ┌─┬─┬─┬─┐'
*S22 = 'Дата виписки податковоi накладноi:     ' + rzdt(dtt) + '                           Порядковий номер  '+rznum(nomndsr,10)+'/'+rznum(0,4)
*s23 = '                                       └─┴─┴─┴─┴─┴─┴─┴─┘                                             └─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘ └─┴─┴─┴─┘'
@ Prow()+1,1 Say space(30)+space(25)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐ ┌─┬─┬─┬─┐'
Stri ++
@ prow()+1,30 say 'Р О З Р А Х У Н О К     N '+rznum(nomndsr,10)+'/'+rznum(0,4)
stri++
@ Prow()+1,1 Say space(30)+space(25)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘ └─┴─┴─┴─┘'
Stri ++
@ prow()+1,20 say 'коригування кiлькiстних i вартiсних показникiв до податкової накладної'
stri++

if gnArm=3
   kplr=pr1->kps
endif
dd_r=getfield('t1','kplr','klndog','dtdogb')
cndogr=alltrim(getfield('t1','kplr','klndog','cndog'))
if empty(cndogr)
   cndogr=alltrim(str(getfield('t1','kplr','klndog','ndog'),6))
endif

if pcor=2
   if !empty(nomndsvzr)
      @ Prow()+1,1 Say space(23)+'┌─┬─┬─┬─┬─┬─┬─┬─┐'+space(3)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(18)+'┌─┬─┬─┬─┬─┬─┬─┬─┐'+space(3)+'┌─┬─┬─┬─┬─┬─┐'
      Stri ++
      @ prow()+1,20 say 'вiд '+rzdt(dnnvzr)+' N '+rznum(nomndsvzr,10)+' за договором вiд '+rzdt(dd_r)+' N '+rzchr(cndogr,6,0)
      stri++
      @ Prow()+1,1 Say space(23)+'└─┴─┴─┴─┴─┴─┴─┴─┘'+space(3)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(18)+'└─┴─┴─┴─┴─┴─┴─┴─┘'+space(3)+'└─┴─┴─┴─┴─┴─┘'
      Stri ++
   else 
      @ prow()+1,20 say 'вiд '+dtoc(dnzr)+' N '+nnzr+' по договору вiд      N      '
      stri++
   endif
   dtt=dnzr
else
   @ prow()+1,20 say 'вiд '+gr1r+' N '+str(ndsdr,6)+' по договору вiд      N      '
   stri++
   dtt=ctod(gr1r)
endif
if .f.
   @ prow()+1,1 say  'Продавець: ' + gcName_c + '                               Покупець: ' + Nklr
   stri++
   @ prow()+1,1 say 'Особа (платник податку) - продавець:                                    Особа (платник податку) - покупець:'
   stri++
   @ prow()+1,1 say  Str(gnKnal_c,12) + '                                                               ' + Str(Nnr,12)
   stri++
   @ prow()+1,1 say 'Мiсце знаходження продавця                                              Мiсце знаходження покупця' 
   stri++
   @ prow()+1,1 say gcAdr_c + '                                           ' + Adrr
   stri++
   @ prow()+1,1 say 'Номер телефону: ' + gcTlf_c + '                                              Номер телефону: ' + Tlfr
   stri++
   @ prow()+1,1 say 'Номер свiдоцтва про реєстрацiю платника                                 Номер свiдоцтва про реєстрацiю платника'
   stri++
   @ prow()+1,1 say '     на додану вартiсть(продавця)                                             на додану вартiсть(покупця)'
   stri++
   @ prow()+1,1 say space(8) + gcSvid_c + '                                                    ' + Nsvr
   stri++

   sele klndog
   if empty(getfield('t1','kpsr','klndog','cndog'))
      ss111=' вiд '+dtoc(getfield('t1','kpsr','klndog','dtdogb'))+' N '+str(getfield('t1','kpsr','klndog','ndog'),6)
   else
      ss111=' вiд '+dtoc(getfield('t1','kpsr','klndog','dtdogb'))+' N '+alltrim(getfield('t1','kpsr','klndog','cndog'))
   endif

   S12 = 'Вид цiвiльно-правового договору:договiр поставки '+ss111+' '+Str(kpsr,7)
   @ prow()+1,1 say S12
   stri++
   @ prow()+1,1 say 'Дата оплати'
   stri++
else
   nn11r=iif(len(gcName_c)>30,subs(gcName_c,1,30),padr(gcName_c,30)) 
   if len(gcName_c)>30
      nn12r=iif(len(subs(gcName_c,31,30))>30,subs(gcName_c,31,30),padr(subs(gcName_c,31,30),30)) 
   else
      nn12r=space(30) 
   endif    
   nn21r=iif(len(nklr)>40,subs(nklr,1,40),padr(nklr,40)) 
   if len(nklr)>40
      nn22r=iif(len(subs(nklr,41,40))>40,subs(nklr,41,40),padr(subs(nklr,41,40),40)) 
   else
      nn22r=space(40) 
   endif    
   s40=space(21)+'┌──────────────────────────────┐'+space(65)+'┌────────────────────────────────────────┐'
   s41='Особа (платник       │'+nn11r+'│'+space(45)+'Особа (платник      │'+nn21r+'│'
   s42='податку) - продавець │'+nn12r+'│'+space(45)+'податку) - покупець │'+nn22r+'│'
   s43=space(21)+'└──────────────────────────────┘'+space(65)+'└────────────────────────────────────────┘'
   @ prow()+1,1 say s40
   stri++
   @ prow()+1,1 say s41
   stri++
   @ prow()+1,1 say s42
   stri++
   @ prow()+1,1 say s43
   stri++
   
   s51='┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(73)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
   s52=rznum(gnKnal_c,12) +space(73)+rznum(nnr,12)
   s53='└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(73)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'
   @ prow()+1,1 say s51
   stri++
   @ prow()+1,1 say s52
   stri++
   @ prow()+1,1 say s53
   stri++

   adr11r=iif(len(gcAdr_c)>30,subs(gcAdr_c,1,30),padr(gcAdr_c,30)) 
   if len(gcAdr_c)>30
      adr12r=iif(len(subs(gcAdr_c,31,30))>30,subs(gcAdr_c,31,30),padr(subs(gcAdr_c,31,30),30)) 
   else
      adr12r=space(30) 
   endif    
   adr21r=iif(len(adrr)>40,subs(adrr,1,40),padr(adrr,40)) 
   if len(adrr)>40
      adr22r=iif(len(subs(adrr,41,40))>40,subs(adrr,41,40),padr(subs(adrr,41,40),40)) 
   else
      adr22r=space(40) 
   endif    
   S6  = 'Мiсцезнаходження           '+adr11r+space(41)+'Мiсцезнаходження          '+adr21r 
   S7  = '(податкова ареса) продавця '+adr12r+space(41)+'(податкова ареса) покупця '+adr22r
   @ prow()+1,1 say s6
   stri++
   @ prow()+1,1 say s7
   stri++

   tt1r=strtran(alltrim(gcTlf_c),'-') 
   tt2r=strtran(alltrim(Tlfr),'-') 
   s81=space(16)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(61)+space(16)+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
   S82='Номер телефону: ' + rzchr(tt1r,10,0)+space(61)+'Номер телефону: ' + rzchr(tt2r,10,0)
   s83=space(16)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(61)+space(16)+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'
   @ prow()+1,1 say s81
   stri++
   @ prow()+1,1 say s82
   stri++
   @ prow()+1,1 say s83
   stri++

   S9  = 'Номер свiдоцтва про          '+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'+space(48)+'Номер свiдоцтва про         '+'┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐'
   S10 = 'реєстрацiю платника податку  '+rzchr(alltrim(gcSvid_c),10,0)+space(48)+'реєстрацiю платника податку '+rzchr(alltrim(Nsvr),10,0) 
   S11 = 'на додану вартiсть(продавця) '+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'+space(48)+'на додану вартiсть(покупця) '+'└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘'
   @ prow()+1,1 say s9
   stri++
   @ prow()+1,1 say s10
   stri++
   @ prow()+1,1 say s11
   stri++
   dd_r=getfield('t1','kpsr','klndog','dtdogb')
   cndogr=alltrim(getfield('t1','kpsr','klndog','cndog'))
   if empty(cndogr)
      cndogr=alltrim(str(getfield('t1','kpsr','klndog','ndog'),6))
   endif
   s121=space(53)+'┌─┬─┬─┬─┬─┬─┬─┬─┐'+space(3)+'┌─┬─┬─┬─┬─┬─┐'
   S122='Вид цiвiльно-правового договору:договiр поставки '+'вiд '+rzdt(dd_r)+' N '+rzchr(cndogr,6,0)+' '+str(kpsr,7)
   s123=space(53)+'└─┴─┴─┴─┴─┴─┴─┴─┘'+space(3)+'└─┴─┴─┴─┴─┴─┘'
   @ prow()+1,1 say s121
   stri++
   @ prow()+1,1 say s122
   stri++
   @ prow()+1,1 say s123
   stri++
   dd_r=ctod('')
   s131=space(12)+'┌─┬─┬─┬─┬─┬─┬─┬─┐'
   S132='Дата оплати '+rzdt(dd_r)
   s133=space(12)+'└─┴─┴─┴─┴─┴─┴─┴─┘'
   @ prow()+1,1 say s131
   stri++
   @ prow()+1,1 say s132
   stri++
   @ prow()+1,1 say s133
   stri++
endif    
if pcor=2
   @ prow()+1,1 say 'Форма проведення разрахункiв: р/р' 
else
   @ prow()+1,1 say 'Форма проведення разрахункiв: ' + iif(empty(Nopr),'р/р',nopr)
endif
stri++
retu .t.
***************
func head44()
***************
Setprc(0,0)

@ prow()+1,1 say '--------------------------------------------------------------------------------------------------------------------------------------------------------------------'
stri++
@ prow()+1,1 say '|   Дата   |    Причина       |   Номенклатура товарiв/послуг, вартiсть чи       |Один.|Коригування кiлькостi| Коригування вартостi| Пiдлягають коригуванню обсяги  |'
stri++
@ prow()+1,1 say '|коригуван |   коригування    |          кiлькiсть яких коригуеться              | вим.|---------------------|---------------------|     без урахування ПДВ,що      |'
stri++
@ prow()+1,1 say '|          |                  |                                                  |     |   Змiна  |   Цiна   |  Змiна   | Кiлькiсть|  оподатковуються за ставками   |'
stri++
@ prow()+1,1 say '|          |                  |                                                  |     | кiлькоcтi|постачання|   цiни   |постачання|--------------------------------|'
stri++
@ prow()+1,1 say '|          |                  |                                                  |     |об"ем,обся|тов/посл  | (-) (+)  |тов/посл  |    20%   |     0%   |звiльнення|'
stri++
@ prow()+1,1 say '|          |                  |                                                  |     |  (-) (+) |          |          |          |  (-) (+) |  (-) (+) |вiд ПДВ с5|'
stri++
@ prow()+1,1 say '---------------------------------------------------------------------------------------------------------------------------------------------------------------------'
stri++
@ prow()+1,1 say '|    1     |        2         |                          3                       |  4  |     5    |     6    |     7    |     8    |     9    |    10    |    11    |'
stri++
@ prow()+1,1 say '--------------------------------------------------------------------------------------------------------------------------------------------------------------------|'
stri++
@ prow()+1,1 say '|          |                  |                                                  |     |          |          |          |          |          |          |          |'
stri++
@ prow()+1,1 say ''
retu .t.
**********************************************************************
func foot22()
**********************************************************************
sgr1r ='Усього    '  && space(10)   && Дата
sgr2r =space(18)  && Причина
if pcor=2
   sgr3r =space(50)  && Наименование
else
   sgr3r =space(50)  && Наименование
endif
sgr4r =space(5)   && Ед изм.
sgr5r =space(10)  && Изм.кол-ва (корр.кол-ва)
sgr6r =space(10)  && Изм.цены   (корр.кол-ва)
sgr7r =space(10)  && Изм.цены   (корр.стоимости)
sgr8r =space(10)  && Изм.кол-ва (корр.стоимости)
sgr9r =str(sgr9,10,2)  && 20%
sgr10r=space(10)  &&  0%
sgr11r=space(10)  && ст.5
sgr12r=str(sgr12,10,2)  && ум.обяз.(отр.гр.9)
if pcor=2
   sgr13r=str(sgr13,10,2)  && ум.кред.(отр.гр.9)
   sgr14r=space(10)  && ув.обяз.(пол.гр.9)
   sgr15r=space(10)  && ув.кред.(пол.гр.9)
else  
   sgr13r=str(sgr13,10,2)  && ум.кред.(отр.гр.9)
   sgr14r=str(sgr14,10,2)  && ув.обяз.(пол.гр.9)
   sgr15r=str(sgr15,10,2)  && ув.кред.(пол.гр.9)
endif
listr='|'+sgr1r+'|'+sgr2r+'|'+sgr3r+'|'+sgr4r+'|'+sgr5r+'|'+sgr6r+'|'+sgr7r;
     +'|'+sgr8r+'|'+sgr9r+'|'+sgr10r+'|'+sgr11r+'|'
@ Prow()+1,1 Say listr               
@ prow()+1,1 say '--------------------------------------------------------------------------------------------------------------------------------------------------------------------|'

listr='|'+'Сума коригування податкового забов"язання та податкового кредиту'+space(66)+'|'+sgr12r+'|'+'XXXXXXXXXX'+'|'+'XXXXXXXXXX'+'|'
@ Prow()+1,1 Say listr               
@ prow()+1,1 say '--------------------------------------------------------------------------------------------------------------------------------------------------------------------|'

@ prow()+1,1 say 'Суми ПДВ,якi скоригованi у зв"язку зi змiною кiлькiсних чи вартiсних показникiв,що зазначенi в цьому розрахунку,визначенi правильно,включенi'
@ prow()+1,1 say 'вiдповiдно до податкового забов"язання з одночасним вiдображенням у реестрi отриманих та виданих податкових накладних.'       
@ prow()+1,1 say ''
@ prow()+1,1 say '                                                            _____________________________________________________________'
@ prow()+1,1 say '                                                          (дата,пiдпис i прiзвище особи,яка склала розрахунок коригування)'
@ prow()+1,1 say 'Розрахунок коригування вiд_________________________N______до податковоi накладноi вiд____________________N_________отримав i зобов"язуюся'
@ prow()+1,1 say 'включити суми коригування до реєстру виданих та отриманих податкових накладних та сум податкового кредиту i податкового зобов"язання '
@ prow()+1,1 say ''
@ prow()+1,1 say ''
@ prow()+1,1 say '                                                            _____________________________________________________________'
@ prow()+1,1 say '                                                                     (дата отримання розрахунку,пiдпис покупця)'
@ prow()+1,1 say '  '
retu .t.

