*
***************
func hdndsr2n()
***************
if nlstr#1
   ?space(140)+'Лист '+str(nlstr,2)
   lsten(2)
endif
?'┌───┬──────────┬──────────────────────────────────────────────┬──────────┬─────┬──────────┬──────────┬──────────────────────────────────────────────┬───────────┐'
lsten(2)
?'│ Р │   Дата   │                 Номенклатура                 │Код товару│Одини│ Кiлькiсть│   Цiна   │    Обсяг постачання(база оподаткування)      │ Загальна  │'
lsten(2)
?'│ О │виникнення│               товарiв/ послуг                │згiдно з  │ця ви│(об"ем,   │постачання│      без урахування ПДВ,що пiдлягають        │сума коштiв│'
lsten(2)
?'│ З │податковог│                   продавця                   │ УКТ ЗЕД  │мiру │ обсяг)   │одиницi   │          оподаткуванню за ставками           │що пiдлягає│'
lsten(2)
?'│ Д │о зобов"яз│                                              │          │товар│          │товару/   ├───────┬─────────┬─────────────────┬──────────┤  сплатi   │'
lsten(2)
?'│ I │ання(поста│                                              │          │у/пос│          │послуг без│       │         │  нульова ставка │          │           │'
lsten(2)
?'│ Л │чання(опла│                                              │          │луги │          │урахування│       │         ├─────────┬───────┤          │           │'
lsten(2)
?'│   │ти2))     │                                              │          │     │          │   ПДВ    │основна│ставка 7%│постачанн│       │звiльнення│           │'
lsten(2)
?'│   │          │                                              │          │     │          │          │ставка │         │на митнiй│експорт│вiд ПДВ3  │           │'
lsten(2)
?'│   │          │                                              │          │     │          │          │       │         │терiторiї│       │          │           │'
lsten(2)
?'│   │          │                                              │          │     │          │          │       │         │України  │       │          │           │'
lsten(2)
?'├───┼──────────┼──────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┼───────────┤'
lsten(2)
?'│ 1 │    2     │                        3                     │  4       │  5  │     6    │     7    │   8   │    9    │   10    │   11  │    12    │     13    │'
lsten(2)
?'├───┼──────────┼──────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┼───────────┤'
lsten(2)
?'│ I │          │                                              │          │     │          │          │       │         │         │       │          │           │'
lsten(2)
retu .t.

***************
func ftndsr2n()
***************
?'│   ├─────────────────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┤           │'
lsten(4)
?'│   │ Усього за роздiлом I                                    │    X     │  X  │     X    │     X    │'+str(sm10_r,7,2)+'│         │         │       │          │'+Str(sm10_r,11,2)+'│'
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┼───────────┤'
lsten(4)
?'│ II│ Зворотня(заставна) тара                                 │    X     │  X  │     X    │     X    │   X   │     X   │     X   │   X   │     X    │'+iif(sm19r#0,Str(sm19r,11,2),space(11))+'│'
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┼───────────┤'
lsten(2)
if dnn_r<ctod('01.12.2014')
   ?'│III│ Податок на додану вартiсть                              │    X     │  X  │     X    │     X    │'+Str(sm10_r*20/100,12,2)+'│          │          │          │'+Str(sm10_r*20/100,12,2)+'│'
else
   ?'│III│ Податок на додану вартiсть                              │    X     │  X  │     X    │     X    │'+Str(sm10_r*20/100,7,2)+'│         │    0    │   0   │    X     │'+Str(sm10_r*20/100,11,2)+'│'
endif
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼───────┼─────────┼─────────┼───────┼──────────┼───────────┤'
lsten(2)
?'│ IV│ Загальна сума з ПДВ                                     │    X     │  X  │     X    │     X    │'+Str((sm10_r+sm10_r*20/100),7,2)+'│         │         │       │          │'+Str((sm10_r+sm10_r*20/100+sm19r),11,2)+'│'
lsten(4)
?'└───┴─────────────────────────────────────────────────────────┴──────────┴─────┴──────────┴──────────┴───────┴─────────┴─────────┴───────┴──────────┴───────────┘'
lsten(4)

?'Суми ПДВ, нарахованi(сплаченi) в зв"язку з постачанням товарiв/послуг,зазначених у цiй накладнiй, визначенi правильно,'
lsten(4)
?'вiдповiдають сумi податкових зобов"язань продавця i включенi до реєстру виданих та отриманих податкових накладних.'
lsten(4)

?''
lsten(4)
?''
lsten(4)
?'                                                                               ___________________________________________/'+nmndsr //gcName
lsten(4)
?'                                                                               (пiдпис,iнiцiали та прiзвище особи, яка склала податкову накладну)'
lsten(4)
?'----------------------------------------------------------------------------------------------------------------------------------------------------------'
lsten(4)

?'1 Зазначається код виду дiяльностi, що передбачає спецiальний режим оподаткування(2, або 3, або 4), у разi складання податкової накладної за такою дiяльнiстю.'
lsten(4)
?'2 Дата оплати ставиться у разi попередньоi оплати постачання, на яку виписуеться податкова накладна, для операцiй з постачання товарiв/послуг вiдповiдно до'
lsten(4)
?'пункту 187.10 статтi 187 роздiлу V Податкового кодексу України.'
lsten(4)
?'3_____________________________________________________________________________________________________________________________________________________________'
lsten(4)
?'              (вiдповiднi пункти (пiдпункти), статтi, пiдроздiли, роздiли Податкового кодексу України, якими передбачено звiльненя вiд оподаткування)'
lsten(4)
eject
retu .t.

**************
func hdndsp2n()
**************
?'┌──────────┬──────────────────┬──────────────────────────────────────────────┬──────────┬─────┬─────────────────────┬─────────────────────┬───────────────────────────────────────────┐'
lsten(2)
?'│   Дата   │    Причина       │ Номенклатура товарiв/послуг, вартiсть чи     │Код товару│Один.│Коригування кiлькостi│ Коригування вартостi│      Пiдлягають коригуванню обсяги        │'
lsten(2)
?'│коригуван │   коригування    │        кiлькiсть яких коригується            │  згiдно  │ вим.├──────────┬──────────┼──────────┬──────────┤          без урахування ПДВ,що            │'
lsten(2)
?'│          │                  │                                              │ з УКТ ЗЕД│     │   Змiна  │   Цiна   │  Змiна   │ Кiлькiсть├──────────┬──────────┬──────────┬──────────┤'
lsten(2)
?'│          │                  │                                              │          │     │ кiлькоcтi│постачання│   цiни   │постачання│оподатков.│оподатков.│оподатков.│звiльненi │'
lsten(2)
?'│          │                  │                                              │          │     │об"ем,обся│тов/посл  │ (-) (+)  │тов/посл  │за осн ст │за ст 7%  │за нуль ст│ вiд ПДВ  │'
lsten(2)
?'│          │                  │                                              │          │     │  (-) (+) │          │          │          │  (-) (+) │          │  (-) (+) │ (-) (+)  │'
lsten(2)
?'├──────────┼──────────────────┼──────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(2)
?'│    1     │        2         │                       3                      │     4    │  5  │     6    │     7    │     8    │     9    │    10    │    11    │    12    │    13    │'
lsten(2)
?'├──────────┼──────────────────┼──────────────────────────────────────────────┼──────────┼─────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(2)
retu .t.

**************
func ftndsp2n()
**************
sgr1r ='Усього    '  // space(10)   // Дата
sgr2r =space(18)  // Причина
sgr3r =space(46)  // Наименование
sgr4r =space(10)  // УКТ ЗЕД
sgr5r =space(5)   // Ед изм.
sgr6r =space(10)  // Изм.кол-ва (корр.кол-ва)
sgr7r =space(10)  // Изм.цены   (корр.кол-ва)
sgr8r =space(10)  // Изм.цены   (корр.стоимости)
sgr9r =space(10)  // Изм.кол-ва (корр.стоимости)
sgr10r =str(sgr10,10,2)  // 20%
sgr11r=space(10)  //  0%
sgr12r=space(10)  // ст.5
sgr13r=str(sgr10*20/100,10,2)  // ст.5
?'├──────────┴──────────────────┴──────────────────────────────────────────────┴──────────┴─────┴──────────┴──────────┴──────────┴──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(4)
if prvzznr=0
   ?'│Усього                                                                                                                                   │'+sgr10r+'│'+'          '+'│'+'          '+'│'+'          '+'│'
else // prvzznr=1
   if pr1ndsr=0
      ?'│Усього                                                                                                                                   │'+str(-sm10r-sm18r,10,2)+'│'+'          '+'│'+'          '+'│'+'          '+'│'
   else
      ?'│Усього                                                                                                                                   │'+str(-sgr10,10,2)+'│'+'          '+'│'+'          '+'│'+'          '+'│'
   endif
endif
lsten(4)
?'├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(4)
if pr1ndsr=1
   ?'│Сума коригування податкового забов"язання та податкового кредиту                                                                         │'+sgr13r+'│'+'    X     '+'│'+'    X     '+'│'+'    X     '+'│'
else
   ?'│Сума коригування податкового забов"язання та податкового кредиту                                                                         │'+str(-sm11r,10,2)+'│'+'    X     '+'│'+'    X     '+'│'+'    X     '+'│'
endif
lsten(4)
?'└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴──────────┴──────────┴──────────┴──────────┘'
lsten(4)

?'Суми ПДВ,якi скоригованi у зв"язку зi змiною кiлькiсних чи вартiсних показникiв,що зазначенi в цьому розрахунку,визначенi правильно,включенi'
lsten(4)
?'вiдповiдно до податкового забов"язання з одночасним вiдображенням у реестрi отриманих та виданих податкових накладних.'
lsten(4)
?''
lsten(4)
?'                                                            _____________________________________________________________'
lsten(4)
?'                                                          (дата,пiдпис iнiцiали та прiзвище особи,яка склала розрахунок коригування)'
lsten(4)
?'Розрахунок коригування вiд_________________________N______до податковоi накладноi вiд____________________N_________отримав i зобов"язуюся'
lsten(4)
?'включити суми коригування до реєстру виданих та отриманих податкових накладних та сум податкового кредиту i податкового зобов"язання '
lsten(4)
? ''
lsten(4)
?''
lsten(4)
?'                                                            _____________________________________________________________'
lsten(4)
?'                                                                     (дата отримання розрахунку,пiдпис покупця)'
lsten(4)
?'  '
eject
retu .t.
***************
func hdndsr3n()
***************
if nlstr#1
   ?space(140)+'Лист '+str(nlstr,2)
   lsten(2)
endif
?'┌───┬──────────┬──────────────────────────────────────────────┬──────────┬───────────┬─────────┬──────────┬─────────────────────────────────────────┬───────────┐'
lsten(2)
?'│ Р │   Дата   │                 Номенклатура                 │Код товару│Одиниця  ви│Кiлькiсть│   Цiна   │ Обсяг постачання(база оподаткування)    │ Загальна  │'
lsten(2)
?'│ О │виникнення│               товарiв/ послуг                │згiдно з  │мiру товару│(об"ем,  │постачання│  без урахування ПДВ,що пiдлягають       │сума коштiв│'
lsten(2)
?'│ З │податковог│                   продавця                   │ УКТ ЗЕД  │/послуги   │ обсяг)  │одиницi   │       оподаткуванню за ставками         │що пiдлягає│'
lsten(2)
?'│ Д │о зобов"яз│                                              │          ├──────┬────┤         │товару/   ├───────┬─────────┬─────────────────┬─────┤  сплатi   │'
lsten(2)
?'│ I │ання(поста│                                              │          │Умовне│Код │         │послуг без│       │         │  нульова ставка │     │           │'
lsten(2)
?'│ Л │чання(опла│                                              │          │позна │    │         │урахування│       │         ├─────────┬───────┤     │           │'
lsten(2)
?'│   │ти2))     │                                              │          │чання │    │         │   ПДВ    │основна│ставка 7%│постачанн│       │звiль│           │'
lsten(2)
?'│   │          │                                              │          │(украї│    │         │          │ставка │         │на митнiй│експорт│нення│           │'
lsten(2)
?'│   │          │                                              │          │нске) │    │         │          │       │         │терiторiї│       │вiд  │           │'
lsten(2)
?'│   │          │                                              │          │      │    │         │          │       │         │України  │       │ПДВ3 │           │'
lsten(2)
?'├───┼──────────┼──────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┼───────────┤'
lsten(2)
?'│ 1 │    2     │                        3                     │  4       │  5.1 │ 5.2│    6    │     7    │   8   │    9    │   10    │   11  │  12 │     13    │'
lsten(2)
?'├───┼──────────┼──────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┼───────────┤'
lsten(2)
?'│ I │          │                                              │          │      │    │         │          │       │         │         │       │     │           │'
lsten(2)
retu .t.

***************
func ftndsr3n()
***************
?'│   ├─────────────────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┤           │'
lsten(4)
?'│   │ Усього за роздiлом I                                    │    X     │   X  │ X  │    X    │     X    │'+str(sm10_r,7,2)+'│         │         │       │     │'+Str(sm10_r,11,2)+'│'
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┼───────────┤'
lsten(4)
?'│ II│ Зворотня(заставна) тара                                 │    X     │   X  │ X  │    X    │     X    │   X   │     X   │     X   │   X   │  X  │'+iif(sm19r#0,Str(sm19r,11,2),space(11))+'│'
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┼───────────┤'
lsten(2)
?'│III│ Податок на додану вартiсть                              │    X     │   X  │ X  │    X    │     X    │'+Str(sm10_r*20/100,7,2)+'│         │    0    │   0   │  X  │'+Str(sm10_r*20/100,11,2)+'│'
lsten(4)
?'├───┼─────────────────────────────────────────────────────────┼──────────┼──────┼────┼─────────┼──────────┼───────┼─────────┼─────────┼───────┼─────┼───────────┤'
lsten(2)
?'│ IV│ Загальна сума з ПДВ                                     │    X     │   X  │ X  │    X    │     X    │'+Str((sm10_r+sm10_r*20/100),7,2)+'│         │         │       │     │'+Str((sm10_r+sm10_r*20/100+sm19r),11,2)+'│'
lsten(4)
?'└───┴─────────────────────────────────────────────────────────┴──────────┴──────┴────┴─────────┴──────────┴───────┴─────────┴─────────┴───────┴─────┴───────────┘'
lsten(4)

?'Суми ПДВ, нарахованi(сплаченi) в зв"язку з постачанням товарiв/послуг,зазначених у цiй накладнiй, визначенi правильно,'
lsten(4)
?'вiдповiдають сумi податкових зобов"язань продавця i включенi до реєстру виданих та отриманих податкових накладних.'
lsten(4)

?''
lsten(4)
?''
lsten(4)
?'                                                                               ___________________________________________/'+nmndsr //gcName
lsten(4)
?'                                                                               (iнiцiали та прiзвище особи, яка склала податкову накладну)'
lsten(4)
?'----------------------------------------------------------------------------------------------------------------------------------------------------------'
lsten(4)

?'1 Зазначається код виду дiяльностi, що передбачає спецiальний режим оподаткування(2, або 3), у разi складання податкової накладної за такою дiяльнiстю.'
lsten(4)
?'2 Дата оплати ставиться у разi попередньоi оплати постачання, на яку виписуеться податкова накладна, для операцiй з постачання товарiв/послуг вiдповiдно до'
lsten(4)
?'пункту 187.10 статтi 187 роздiлу V Податкового кодексу України.'
lsten(4)
?'3_____________________________________________________________________________________________________________________________________________________________'
lsten(4)
?'              (вiдповiднi пункти (пiдпункти), статтi, пiдроздiли, роздiли Податкового кодексу України, якими передбачено звiльненя вiд оподаткування)'
lsten(4)
eject
retu .t.
**************
func hdndsrn3()
**************
if pr1ndsr=0
   ?str(ttnr,6)+space(134)+'Лист '+str(nlstr,2)
else
   ?space(140)+'Лист '+str(nlstr,2)
endif
lsten(1)
?''
lsten(1)
?''
lsten(1)
?''
lsten(1)
?''
lsten(1)
?'┌────────────────────────────────────────────────────┬─────┐'+space(53)+'ЗАТВЕРДЖЕНО'
lsten(1)
?'│Складається оператором iнвестору за багатостороньою │  '+iif(nn2_r#0,' ',' ')+'  │'+space(53)+'Наказ Мiнiстерсва фiнансiв України'
lsten(1)
?'│угодою про розподiл продукцiї                       │     │'+space(53)+'22 вересня 2014 року N 957'
lsten(1)
?'├────────────────────────────────────────────────────┼─────┤'+space(53)+'(у редакции наказу Мiнiстерсва фiнансiв України'
lsten(1)
?'│Не видається покупцю                                │  '+iif(nn2_r=0,'X',' ')+'  │'+space(53)+'вiд 14 листопада 2014 року N 1129)'
lsten(1)
?'│                                                    ├─────┤'
lsten(1)
?'│(тип причини)                                       │ '+iif(nn2_r=0,'02','  ')+'  │'
lsten(1)
?'└────────────────────────────────────────────────────┴─────┘'
lsten(1)
?'(потрiбне вiдмiтити помiткою "X")            '+space(18)+'П О Д А Т К О В А   Н А К Л А Д Н А'
lsten(1)
?''
lsten(1)
?'Дата складання податкової накладної    ' +subs(dtos(dnn_r),7,2)+subs(dtos(dnn_r),5,2)+subs(dtos(dnn_r),1,4)+space(36)+'Порядковий номер  '+space(36)+str(nnds_r,7)+'/ /' //+str(0,5)
lsten(1)
?'                                                                                                                    '+space(28)+'(1)'+'(номер фiлiї)'
lsten(1)


nn11r=iif(len(nai1r)>50,subs(nai1r,1,50),padl(nai1r,50))
if len(nai1r)>50
   nn12r=iif(len(subs(nai1r,51,50))>50,subs(nai1r,51,50),padl(subs(nai1r,51,50),50))
else
   nn12r=space(50)
endif

nn21r=iif(len(nai2r)>50,subs(nai2r,1,50),padl(nai2r,50))
if len(nai2r)>50
   nn22r=iif(len(subs(nai2r,51,50))>50,subs(nai2r,51,50),padl(subs(nai2r,51,50),50))
else
   nn22r=space(50)
endif
   ?space(21)+'┌──────────────────────────────────────────────────┐'+space(36)+'┌──────────────────────────────────────────────────┐'
   lsten(1)
   ?'Особа (платник       │'+nn11r+'│'+space(10)+'Особа (платник      '+space(6)+'│'+nn21r+'│'
   lsten(1)
   ?'податку) - продавець │'+nn12r+'│'+space(10)+'податку) - покупець '+space(6)+'│'+nn22r+'│'
   lsten(1)
   ?space(21)+'└──────────────────────────────────────────────────┘'+space(36)+'└──────────────────────────────────────────────────┘'
   lsten(1)
   ?space(21)+'  (найменування; прiзвище, iм"я, по батьковi - для '+space(38)+' (найменування;прiзвище,iм"я,по батьковi, - для    '
   lsten(1)
   ?space(21)+'            фiзичної особи - пiдприємця)           '+space(38)+'            фiзичної особи - пiдприємця)           '
   lsten(1)

   ?space(61)+str(nn1r,12) +space(76)+iif(empty(cnn2r),str(nn2r,12),cnn2r)
   lsten(1)
   ?space(32)+'(iндивiдуальний податковий номер продавця)'+space(46)+'(iндивiдуальний податковий номер покупця)'
   lsten(1)


adr11r=iif(len(adr1r)>46,subs(adr1r,1,46),padl(adr1r,46))
if len(adr1r)>46
   adr12r=iif(len(subs(adr1r,47,46))>30,subs(adr1r,47,46),padl(subs(adr1r,47,46),46))
else
   adr12r=space(46)
endif
adr21r=iif(len(adr2r)>51,subs(adr2r,1,51),padl(adr2r,51))
if len(adr2r)>50
   adr22r=iif(len(subs(adr2r,51,50))>51,subs(adr2r,52,50),padl(subs(adr2r,52,50),50))
   adr23r=padl(subs(adr2r,101,50),50)
else
   adr22r=space(50)
   adr23r=space(50)
endif
?'Мiсцезнаходження           '+adr11r+space(10)+'Мiсцезнаходження           '+adr21r
lsten(1)
?'(податкова ареса) продавця '+adr12r+space(10)+'(податкова ареса) покупця  '+adr22r
lsten(1)
if !empty(adr23r)
   ?space(54)+adr23r
   lsten(1)
endif

tt1r=strtran(alltrim(tlf1r),'-')
tt2r=strtran(alltrim(tlf2r),'-')
   ?''
   lsten(1)
   ?'Номер телефону  '+space(47) + padr(tt1r,10)+space(10)+'Номер телефону  '+space(52)+padr(tt2r,10)
   lsten(1)
   ?''
   lsten(1)


dd_r=getfield('t1','kklr','klndog','dtdogb')
if prmk17r=0
   cndogr=alltrim(getfield('t1','kklr','klndog','cndog'))
   if empty(cndogr)
      cndogr=alltrim(str(getfield('t1','kklr','klndog','ndog'),6))
   endif
else
   cndogr='383/КО/11-ПН'
endif

if kklr=2401764
      ?'Вид цивiльно-правового договору:договiр про реалiзацiю продуктiв харчування '+space(22)+'вiд '+subs(dtos(dd_r),7,2)+subs(dtos(dd_r),5,2)+subs(dtos(dd_r),1,4)+' N '+padl(cndogr,12)  //+' '+str(kplr,7)
      lsten(1)
      ?''
      lsten(1)
else
      if nn2_r#0
         ?'Вид цивiльно-правового договору '+repl('_',78)+'договiр поставки '+'вiд '+subs(dtos(dd_r),7,2)+subs(dtos(dd_r),5,2)+subs(dtos(dd_r),1,4)+space(4)+' N '+space(3)+padl(cndogr,12)  //+' '+str(kplr,7)
      else
         ?'Вид цивiльно-правового договору '+repl('_',78)+'рахунок          '+'вiд '+subs(dtos(dnn_r),7,2)+subs(dtos(dnn_r),5,2)+subs(dtos(dnn_r),1,4)+space(4)+' N '+space(3)+padl(str(rn_r,6),12)  //+' '+str(kplr,7)
      endif
      lsten(1)
      ?space(31)+space(35)+'(вид договору)'
      lsten(1)
      ?''
      lsten(1)
endif
?'Форма проведених разрахункiв  '+space(100)+padl(iif(fopr=0,'р/р',alltrim(getfield('t1','fopr','fop','nfop'))),30)
lsten(1)
?'                              '+repl('─',131)
lsten(1)
?'                                 (бартер, готiвка, оплата з поточного рахунку, чек тощо)'
lsten(1)
retu .t.
**************
func hdndspn3()
**************
if pr1ndsr=0
   ?str(ndr,6)+'('+str(ttnvzr,6)+')'+space(132)+'Лист '+str(nlstr,2)
else
   ?space(146)+'Лист '+str(nlstr,2)
endif
lsten(1)
   ?'┌─────────────────────────────────────┬─────┐'+space(95)+'Додаток 2'
   lsten(1)
   ?'│Пiдлягає реестрацiї в ЄРПН покупцем  │  '+iif(nn2_r#0,'X',' ')+'  │'+space(95)+'до податкової накладної'
   lsten(1)
   ?'├─────────────────────────────────────┼─────┤'
   lsten(1)
   ?'│Складається оператором iнвестору за  │     │'
   lsten(1)
   ?'│багатосторонньою угодою про розподiл │     │'
   lsten(1)
   ?'│продукцiї                            │     │'
   lsten(1)
   ?'├─────────────────────────────────────┼─────┤'
   lsten(1)
   ?'│Не видається покупцю                 │  '+iif(nn2_r=0,'X',' ')+'  │'
   lsten(1)
   ?'│                                     ├─────┤'
   lsten(1)
   ?'│(тип причини)                        │  '+iif(nn2_r=0,'02','  ')+' │'
   lsten(1)
   ?'└─────────────────────────────────────┴─────┘'
   lsten(1)
   ?'(потрiбне вiдмiтити помiткою "X")'
   lsten(1)
   ?''
   lsten(1)
   ?space(30)+'Р О З Р А Х У Н О К    N '+str(nnds_r,10)+'/ /'+space(13)+' вiд '+subs(dtos(dnn_r),7,2)+subs(dtos(dnn_r),5,2)+subs(dtos(dnn_r),1,4)
   lsten(1)
   ?space(47)+'(порядковий номер)'+'(1)'+'(номер фiлiї)'+'(дата складання)'
   lsten(1)
   ?space(30)+'коригування кiлькiстних i вартiсних показникiв до податкової накладної'
   lsten(1)

dd_r=getfield('t1','kklr','klndog','dtdogb')
cndogr=alltrim(getfield('t1','kklr','klndog','cndog'))
if empty(cndogr)
   cndogr=alltrim(str(getfield('t1','kklr','klndog','ndog'),6))
endif

   ?''
   lsten(1)
      ?space(30)+'вiд '+subs(dtos(dnn1_r),7,2)+subs(dtos(dnn1_r),5,2)+subs(dtos(dnn1_r),1,4)+' N '+str(nnds1_r,10)+space(11)+'/ /'+space(13)+' за договором вiд '+subs(dtos(dd_r),7,2)+subs(dtos(dd_r),5,2)+subs(dtos(dd_r),1,4)+' N '+padl(cndogr,6)
      ?space(30)+'(дата складання)'+space(1)+'(порядковий номер)'+space(1)+'(1)'+space(1)+'(номер филiї)'
   lsten(1)
   ?''
   lsten(1)

nn11r=iif(len(nai1r)>50,subs(nai1r,1,50),padl(nai1r,50))
if len(nai1r)>50
   nn12r=iif(len(subs(nai1r,51,50))>50,subs(nai1r,51,50),padl(subs(nai1r,51,50),50))
else
   nn12r=space(50)
endif
nn21r=iif(len(nai2r)>50,subs(nai2r,1,50),padl(nai2r,50))
if len(nai2r)>50
   nn22r=iif(len(subs(nai2r,51,50))>50,subs(nai2r,51,50),padl(subs(nai2r,51,50),50))
else
   nn22r=space(50)
endif
   ?space(21)+'┌──────────────────────────────────────────────────┐'+space(47)+'┌──────────────────────────────────────────────────┐'
   lsten(1)
   ?'Особа (платник       │'+nn11r+'│'+space(27)+'Особа (платник      │'+nn21r+'│'
   lsten(1)
   ?'податку) - продавець │'+nn12r+'│'+space(27)+'податку) - покупець │'+nn22r+'│'
   lsten(1)
   ?space(21)+'└──────────────────────────────────────────────────┘'+space(47)+'└──────────────────────────────────────────────────┘'
   lsten(1)
   ?space(21)+'  (найменування; прiзвище, iм"я, по батьковi - для '+space(49)+' (найменування;прiзвище,iм"я,по батьковi, - для    '
   lsten(1)
   ?space(21)+'            фiзичної особи - пiдприємця)           '+space(49)+'            фiзичної особи - пiдприємця)           '
   lsten(1)

   ?''
   lsten(1)
   ?space(61)+str(nn1r,12) +space(87)+iif(empty(cnn2r),str(nn2r,12),padl(cnn2r,12))
   lsten(1)
   ?''
   lsten(1)

adr11r=iif(len(adr1r)>46,subs(adr1r,1,46),padr(adr1r,46))
if len(adr1r)>46
   adr12r=iif(len(subs(adr1r,47,46))>46,subs(adr1r,47,46),padl(subs(adr1r,47,46),46))
else
   adr12r=space(46)
endif
adr21r=iif(len(adr2r)>46,subs(adr2r,1,46),padl(adr2r,46))
if len(adr2r)>46
   adr22r=iif(len(subs(adr2r,47,46))>46,subs(adr2r,47,46),padl(subs(adr2r,47,46),46))
else
   adr22r=space(46)
endif
?'Мiсцезнаходження             '+adr11r+space(25)+'Мiсцезнаходження          '+adr21r
lsten(1)
?'(податкова ареса) продавця   '+adr12r+space(25)+'(податкова ареса) покупця '+adr22r
lsten(1)

tt1r=strtran(alltrim(tlf1r),'-')
tt2r=strtran(alltrim(tlf2r),'-')
   ?''
   lsten(1)
   ?'Номер телефону  '+space(47) + padl(tt1r,10)+space(27)+'Номер телефону  '+space(46)+ padl(tt2r,10)
   ?''
   lsten(1)

dd_r=getfield('t1','kklr','klndog','dtdogb')
cndogr=alltrim(getfield('t1','kklr','klndog','cndog'))
if empty(cndogr)
   cndogr=alltrim(str(getfield('t1','kklr','klndog','ndog'),6))
endif

   ?''
   lsten(1)
   if nn2_r#0
      ?'Вид цивiльно-правового договору '+repl('_',102)+'договiр поставки '+'вiд '+subs(dtos(dd_r),7,2)+subs(dtos(dd_r),5,2)+subs(dtos(dd_r),1,4)+' N '+padl(cndogr,6)  //+' '+str(kplr,7)
   else
      ?'Вид цивiльно-правового договору '+repl('_',102)+'рахунок          '+'вiд '+subs(dtos(dnn_r),7,2)+subs(dtos(dnn_r),5,2)+subs(dtos(dnn_r),1,4)+space(4)+' N '+padl(str(rn_r,6),12)  //+' '+str(kplr,7)
   endif
   lsten(1)
   ?space(31)+space(45)+'(вид договору)'
   lsten(1)

   ?'1 Зазначається код виду дiяльностi, що передбачає спецiальний режим оподаткування (2,або 3), у разi складання податкової накданої за такою дiяльнiстю'
   lsten(1)
retu .t.
**************
func hdndsp3n()
**************
?'┌──────────┬──────────────────┬──────────────────────────────────────────────┬──────────┬───────────────┬─────────────────────┬─────────────────────┬───────────────────────────────────────────┐'
lsten(2)
?'│   Дата   │    Причина       │ Номенклатура товарiв/послуг, вартiсть чи     │Код товару│Одиниця вiмиру │Коригування кiлькостi│ Коригування вартостi│      Пiдлягають коригуванню обсяги        │'
lsten(2)
?'│коригуван │   коригування    │        кiлькiсть яких коригується            │  згiдно  ├──────────┬────┼──────────┬──────────┼──────────┬──────────┤          без урахування ПДВ,що            │'
lsten(2)
?'│          │                  │                                              │ з УКТ ЗЕД│  Умовне  │Код │   Змiна  │   Цiна   │  Змiна   │ Кiлькiсть├──────────┬──────────┬──────────┬──────────┤'
lsten(2)
?'│          │                  │                                              │          │позначення│    │ кiлькоcтi│постачання│   цiни   │постачання│оподатков.│оподатков.│оподатков.│звiльненi │'
lsten(2)
?'│          │                  │                                              │          │українське│    │об"ем,обся│тов/посл  │ (-) (+)  │тов/посл  │за осн ст │за ст 7%  │за нуль ст│ вiд ПДВ  │'
lsten(2)
?'│          │                  │                                              │          │          │    │  (-) (+) │          │          │          │  (-) (+) │          │  (-) (+) │ (-) (+)  │'
lsten(2)
?'├──────────┼──────────────────┼──────────────────────────────────────────────┼──────────┼──────────┼────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(2)
?'│    1     │        2         │                       3                      │     4    │    5.1   │ 5.2│     6    │     7    │     8    │     9    │    10    │    11    │    12    │    13    │'
lsten(2)
?'├──────────┼──────────────────┼──────────────────────────────────────────────┼──────────┼──────────┼────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(2)
retu .t.
**************
func ftndsp3n()
**************
sgr1r ='Усього    '  // space(10)   // Дата
sgr2r =space(18)  // Причина
sgr3r =space(46)  // Наименование
sgr4r =space(10)  // УКТ ЗЕД
sgr5r =space(5)   // Ед изм.
sgr6r =space(10)  // Изм.кол-ва (корр.кол-ва)
sgr7r =space(10)  // Изм.цены   (корр.кол-ва)
sgr8r =space(10)  // Изм.цены   (корр.стоимости)
sgr9r =space(10)  // Изм.кол-ва (корр.стоимости)
sgr10r =str(sgr10,10,2)  // 20%
sgr11r=space(10)  //  0%
sgr12r=space(10)  // ст.5
sgr13r=str(sgr10*20/100,10,2)  // ст.5
      ?'├──────────┴──────────────────┴──────────────────────────────────────────────┴──────────┴──────────┴────┴──────────┴──────────┴──────────┴──────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(4)
if prvzznr=0
      ?'│Усього                                                                                                                                             │'+sgr10r+'│'+'          '+'│'+'          '+'│'+'          '+'│'
else // prvzznr=1
   if pr1ndsr=0
      ?'│Усього                                                                                                                                             │'+str(-sm10r-sm18r,10,2)+'│'+'          '+'│'+'          '+'│'+'          '+'│'
   else
      ?'│Усього                                                                                                                                             │'+str(-sgr10,10,2)+'│'+'          '+'│'+'          '+'│'+'          '+'│'
   endif
endif
lsten(4)
      ?'├───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┼──────────┼──────────┼──────────┤'
lsten(4)
if pr1ndsr=1
      ?'│Сума коригування податкового забов"язання та податкового кредиту                                                                                   │'+sgr13r+'│'+'    X     '+'│'+'    X     '+'│'+'    X     '+'│'
else
      ?'│Сума коригування податкового забов"язання та податкового кредиту                                                                                   │'+str(-sm11r,10,2)+'│'+'    X     '+'│'+'    X     '+'│'+'    X     '+'│'
endif
lsten(4)
      ?'└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴──────────┴──────────┴──────────┴──────────┘'
lsten(4)

?'Суми ПДВ,якi скоригованi у зв"язку зi змiною кiлькiсних чи вартiсних показникiв,що зазначенi в цьому розрахунку,визначенi правильно та включенi'
lsten(4)
?'до податкового забов"язання.'
lsten(4)
?''
lsten(4)
?'                                                            _____________________________________________________________'
lsten(4)
?'                                                           (iнiцiали та прiзвище особи,яка склала розрахунок коригування)'
lsten(4)
*?'Розрахунок коригування вiд_________________________N______до податковоi накладноi вiд____________________N_________отримав i зобов"язуюся'
*lsten(4)
*?'включити суми коригування до реєстру виданих та отриманих податкових накладних та сум податкового кредиту i податкового зобов"язання '
*lsten(4)
*? ''
*lsten(4)
*?''
*lsten(4)
*?'                                                            _____________________________________________________________'
*lsten(4)
*?'                                                                     (дата отримання розрахунку,пiдпис покупця)'
*lsten(4)
?'  '
eject
retu .t.

***********************************************************************
* с 01.04.2015 приказ №1307 от 31.12.2015 МинФин Укр
***********************************************************************

***************
func hdndsr4n()
* продажа
* шапка номенклатуры
***************
if nlstr#1
   ?space(140)+'Лист '+str(nlstr,2)
   lsten(2)
endif
?'┌────┬────────────────────────────────────────────┬──────────┬──────────────────────┬─────────┬────────────────────────┬──────┬──────┬─────────────────────────┐'
lsten(2)
?'│№з/п│    Номенклатура товарiв/послуг продавця    │Код товару│    Одиниця вимиру    │Кiлькiсть│Цiна постачання одиницi │ Код  │ Код  │    Обсяги постачання    │'
lsten(2)
?'│    │                                            │згiдно з  │    товару/послуги    │(об"ем,  │  товару/послуги без    │ставки│пiльги│   (база оподаткування)  │'
lsten(2)
?'│    │                                            │ УКТ ЗЕД  ├─────────────────┬────┤ обсяг)  │ урахування податку на  │      │ (3)  │без урахування податку на│'
lsten(2)
?'│    │                                            │          │Умовне позначення│Код │         │    додану вартiсть     │      │      │     додану вартiсть     │'
lsten(2)
?'│    │                                            │          │  (українське)   │    │         │                        │      │      │                         │'
lsten(2)
?'├────┼────────────────────────────────────────────┼──────────┼─────────────────┼────┼─────────┼────────────────────────┼──────┼──────┼─────────────────────────┤'
lsten(2)
?'│ 1  │                      2                     │    3     │        4        │  5 │    6    │            7           │  8   │  9   │           10            │'
lsten(2)
?'├────┼────────────────────────────────────────────┼──────────┼─────────────────┼────┼─────────┼────────────────────────┼──────┼──────┼─────────────────────────┤'
lsten(2)
retu .t.

***************
func hdndsrn4()
* продажа
* шапка документа
***************
if pr1ndsr=0
   ?str(ttnr,6)+space(134)+'Лист '+str(nlstr,2)
else
   ?space(140)+'Лист '+str(nlstr,2)
endif
lsten(1)
?''
lsten(1)
?''
lsten(1)
?''
lsten(1)
?''
lsten(1)
?'┌────────────────────────────────────────────────────┬─────┐'+space(53)+'ЗАТВЕРДЖЕНО'
lsten(1)
?'│Зведена податкова накладна                          │  '+iif(nn2_r#0,' ',' ')+'  │'+space(53)+'Наказ Мiнiстерсва фiнансiв України'
lsten(1)
?'├────────────────────────────────────────────────────┼─────┤'+space(53)+'31.12.2015 N 1307'
lsten(1)
?'│Складена на операцiї,звiльненi вiд оподаткування    │     │'
lsten(1)
?'├────────────────────────────────────────────────────┼─────┤'
lsten(1)
?'│Не пидлягає наданню отримувачу(покупцю) з причини   │  '+iif(nn2_r=0,'X',' ')+'  │'
lsten(1)
?'│                                                    ├─────┤'
lsten(1)
?'│(зазначається вiдповiдний тип причини)              │ '+iif(nn2_r=0,'02','  ')+'  │'
lsten(1)
?'└────────────────────────────────────────────────────┴─────┘'
lsten(1)
?space(63)+'П О Д А Т К О В А   Н А К Л А Д Н А'+space(10)+subs(dtos(dnn_r),7,2)+subs(dtos(dnn_r),5,2)+subs(dtos(dnn_r),1,4)+space(19)+str(nnds_r,7)+space(3)+'/ /'
lsten(1)
?space(63)+space(35)+space(10)+'Дата складання' +space(4)+'Порядковий номер'+'   (1)'
lsten(1)
?''
lsten(1)

lnair=71
nn11r=iif(len(nai1r)>lnair,subs(nai1r,1,lnair),padr(nai1r,lnair))
if len(nai1r)>lnair
   nn12r=iif(len(subs(nai1r,lnair+1,lnair))>lnair,subs(nai1r,lnair+1,lnair),padl(subs(nai1r,lnair+1,lnair),lnair))
else
   nn12r=space(lnair)
endif
nn21r=iif(len(nai2r)>lnair,subs(nai2r,1,lnair),padr(nai2r,lnair))
if len(nai2r)>lnair
   nn22r=iif(len(subs(nai2r,lnair+1,lnair))>lnair,subs(nai2r,lnair+1,lnair),padl(subs(nai2r,lnair+1,lnair),lnair))
else
   nn22r=space(lnair)
endif
?'Постачальник(продавець)'+space(53)+space(10)+'Отримувач(покупець)'
lsten(1)
?'┌─────────────────────────────────────────────────────────────────────────┐'+space(10)+'┌─────────────────────────────────────────────────────────────────────────┐'
lsten(1)
?'│┌───────────────────────────────────────────────────────────────────────┐│'+space(10)+'│┌───────────────────────────────────────────────────────────────────────┐│'
lsten(1)
?'││'+nn11r+'││'+space(10)+'││'+nn21r+'││'
lsten(1)
?'││'+nn12r+'││'+space(10)+'││'+nn22r+'││'
lsten(1)
?'│└───────────────────────────────────────────────────────────────────────┘│'+space(10)+'│└───────────────────────────────────────────────────────────────────────┘│'
lsten(1)
?'│(найменування;прiзвище,iм"я,по батьковi-для фiзичної особи-пiдприємця)   │'+space(10)+'│(найменування;прiзвище,iм"я,по батьковi-для фiзичної особи-пiдприємця)   │ '
lsten(1)
?'│'+space(10)+str(nn1r,12)+space(51)+'│'+space(10)+'│'+space(10)+iif(empty(cnn2r),str(nn2r,12),cnn2r)+space(51)+'│'
lsten(1)
?'│'+'(iндивiдуальний податковий номер)'+space(5)+'Номер фiлiї(2)'+space(21)+'│'+space(10)+'│(iндивiдуальний податковий номер)'+space(5)+'Номер фiлiї(2)'+space(21)+'│'
lsten(1)
?'└─────────────────────────────────────────────────────────────────────────┘'+space(10)+'└─────────────────────────────────────────────────────────────────────────┘'
lsten(1)
?'┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐'
lsten(1)
?'│Роздiл А                                                                                                                                                      │'
lsten(1)
?'├────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬─────────────────┤'
lsten(1)
?'│  I │'+padr('Загальна сума коштiв,що пiдлягають сплати з урахуванням податку на додану вартiсть',90)+space(45)+'│'+padl(Str((sm10_rr+sm10_rr*20/100),11,2),17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ II │'+padr('Загальна сума податку на додану вартiсть, у тому числi:',90)+space(45)+'│'+padl(Str(sm10_rr*20/100,11,2),17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ III│'+padr('загальна сума податку на додану вартiсть за основною ставкою',90)+space(45)+'│'+padl(Str(sm10_rr*20/100,11,2),17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ IV │'+padr('загальна сума податку на додану вартiсть за ставкою 7%',90)+space(45)+'│'+space(17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│  V │'+padr('Усього обсяги постачання за основною ставкою(код ставки 20)',90)+space(45)+'│'+padl(Str((sm10_rr+sm10_rr*20/100),11,2),17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ VI │'+padr('Усього обсяги постачання за ставкою 7%(код ставки 7)',90)+space(45)+'│'+space(17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ VII│'+padr('Усього обсяги постачання при експортi товарiв за ставкою 0%(код ставки 901)',90)+space(45)+'│'+space(17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│VIII│'+padr('Усього обсяги постачання на митнiй територiї України за ставкою0%(код ставки 902)',90)+space(45)+'│'+space(17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│ IX │'+padr('Усього обсяги операцiй, звiльнених вiд оподаткування (код ставки 903)',90)+space(45)+'│'+space(17)+'│'
lsten(1)
?'├────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────────┤'
lsten(1)
?'│  X │'+padr('Данi щодо зворотньої(заставної) тари',90)+space(45)+'│'+padl(iif(sm19r#0,Str(sm19r,11,2),space(11)),17)+'│'
lsten(1)
?'├────┴───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴─────────────────┤'
lsten(1)
?'│Роздiл Б                                                                                                                                                      │'
lsten(1)
?'└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘'
lsten(1)
retu .t.

***************
func ftndsr4n()
* продажа
* подвал документа
***************
?'└────┴────────────────────────────────────────────┴──────────┴─────────────────┴────┴─────────┴────────────────────────┴──────┴──────┴─────────────────────────┘'
lsten(4)
?''
lsten(4)
?'Суми податку на додану вартiсть, нарахованi(сплаченi) у зв"язку з постачанням товарiв-послуг,зазначених у цiй накладнiй,визначенi правильно, вiдповiдають сумi '
lsten(4)
?'податкових зобов"язань продавця'
lsten(4)
?''
lsten(4)
?'Посадова(уповноважена) особа/фiзична особа'+space(5)+padr(' ',50)+space(5)
lsten(4)
?'(законний представник)'+space(20)+space(5)+repl('-',50)+space(5)+'(реєстрацiйний номер облiкової картки платника податкiв)'
lsten(4)
?space(104)+'або серiя та номер паспорта(4))'
lsten(4)
?'--------------'
lsten(4)
?'1 У порядковому номерi пiсля символу "/" зазначається код виду дiяльностi, що передбачає спецiальний режим оподаткування (2 або 3), у разi складання податкової '
lsten(4)
?'  накладної за такою дiяльнiстю, або код 5 - у разi складання податкової накладної оператором iнвестору за багатосторонньою угодою про розподiл продукцiї.'
lsten(4)
?'2 Зазначається у разi постачання/придбання товарiв/послуг фiлiєю (структурним пiдроздiлом) товарiв/послуг, яка фактично є вiд iменi головного пiдприємства -'
lsten(4)
?'  платника податку стороною договору.'
lsten(4)
?'3 _______________________________________________________________________________________________________________________________________________________________'
lsten(4)
?'  (у разi вiдсутностi пiльги у довiдниках податкових пiльг зазначаються вiдповiднi пункти(пiдпункти),статтi,пiдроздiли,роздiли Податкового кодексу України та/або'
lsten(4)
?'   мiжнародного договору, якими передбачено звiльнення вiд оподаткування)'
lsten(4)
?'4 Серiю та номер паспорта зазначають фiзичнi особи, якi мають вiдмiтку у паспортi про право здiйснювати будь-якi платежi за серiєю та номером паспорта'
lsten(4)
eject
retu .t.

**************
func hdndsp4n()
* возврат
* шапка номенклатуры
**************
retu .t.

**************
func hdndspn4()
* возврат
* шапка документа
**************
retu .t.

**************
func ftndsp4n()
* возврат
* подвал документа
**************

retu .t.


